MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM343FEXBG/mcu.h
/** Processor and Core Peripheral Section */

/* Configuration of the Cortex-M3 Processor and Core Peripherals */
#define __CM3_REV              0x0201       /*!< Cortex-M3 Core Revision                           */
#define __MPU_PRESENT             0         /*!< MPU present or not                                */
#define __NVIC_PRIO_BITS          3         /*!< Number of Bits used for Priority Levels           */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used      */

/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm3.h"                       /* Cortex-M3 processor and core peripherals            */
// Note: Changed for MikroE implementation.
// #include "system_TMPM343.h"                 /* TMPM343 System                                      */

/** @addtogroup Device_Peripheral_registers
  * @{
  */

/** Device Specific Peripheral registers structures */

/**
  * @brief DMA Controller
  */
typedef struct
{
  __I  uint32_t INTSTATUS;         /*!< DMAC Interrupt Status Register               */
  __I  uint32_t INTTCSTATUS;       /*!< DMAC Interrupt Terminal Count Status Register*/
  __O  uint32_t INTTCCLEAR;        /*!< DMAC Interrupt Terminal Count Clear Register */
  __I  uint32_t INTERRORSTATUS;    /*!< DMAC Interrupt Error Status Register         */
  __O  uint32_t INTERRCLR;         /*!< DMAC Interrupt Error Clear Register          */
  __I  uint32_t RAWINTTCSTATUS;    /*!< DMAC Raw Interrupt Terminal Count Status Register*/
  __I  uint32_t RAWINTERRORSTATUS; /*!< DMAC Raw Error Interrupt Status Register     */
  __I  uint32_t ENBLDCHNS;         /*!< DMAC Enabled Channel Register                */
  __IO uint32_t SOFTBREQ;          /*!< DMAC Software Burst Request Register         */
  __IO uint32_t SOFTSREQ;          /*!< DMAC Software Single Request Register        */
       uint32_t RESERVED0[2];
  __IO uint32_t CONFIGURATION;     /*!< DMAC Configuration Register                  */
       uint32_t RESERVED1[51];
  __IO uint32_t C0SRCADDR;         /*!< DMAC Channel 0 Source Address Register       */
  __IO uint32_t C0DESTADDR;        /*!< DMAC Channel 0 Destination Address Register  */
  __IO uint32_t C0LLI;             /*!< DMAC Channel 0 Linked List Item Register     */
  __IO uint32_t C0CONTROL;         /*!< DMAC Channel 0 Control Register              */
  __IO uint32_t C0CONFIGURATION;   /*!< DMAC Channel 0 Configuration Register        */
       uint32_t RESERVED2[3];
  __IO uint32_t C1SRCADDR;         /*!< DMAC Channel 1 Source Address Register       */
  __IO uint32_t C1DESTADDR;        /*!< DMAC Channel 1 Destination Address Register  */
  __IO uint32_t C1LLI;             /*!< DMAC Channel 1 Linked List Item Register     */
  __IO uint32_t C1CONTROL;         /*!< DMAC Channel 1 Control Register              */
  __IO uint32_t C1CONFIGURATION;   /*!< DMAC Channel 1 Configuration Register        */
} TSB_DMAC_TypeDef;

/**
  * @brief Programmable Servo Controller 
  */
typedef struct
{
  __IO uint32_t UA0;               /*!< Accumulator                                  */
  __IO uint32_t UM0;               /*!< Multiplier Register                          */
  __IO uint32_t UM1;               /*!< Shift Count Register                         */
  __IO uint32_t UL0;               /*!< Upper Limit Value Register                   */
  __IO uint32_t UL1;               /*!< Lower Limit Value Register                   */
  __IO uint32_t UR0;               /*!< Add Sub Value Register 0                     */
  __IO uint32_t UR1;               /*!< Add Sub Value Register 1                     */
  __IO uint32_t SGN;               /*!< Arithmetic Parameter with Signed Register    */
  __IO uint32_t AP0;               /*!< Address Pointer 0                            */
  __IO uint32_t AP1;               /*!< Address Pointer 1                            */
  __IO uint32_t AP2;               /*!< Address Pointer 2                            */
  __IO uint32_t AP3;               /*!< Address Pointer 3                            */
  __IO uint32_t BR0;               /*!< Break Pointer                                */
  __IO uint32_t PG0;               /*!< Program Counter                              */
  __IO uint32_t VG0;               /*!< Repeat Processing Vector Pointer             */
       uint32_t RESERVED0[49];
  __IO uint32_t CNT;               /*!< Control Register                             */
  __IO uint32_t FLG;               /*!< Flag Register                                */
       uint32_t RESERVED1[7102];
  __IO uint32_t REN;               /*!< Run Trigger Enable Register                  */
  __I  uint32_t RFLG;              /*!< Run Trigger Flag Register                    */
  __O  uint32_t RCLR;              /*!< Run Trigger Clear Register                   */
  __O  uint32_t RSET;              /*!< Run Trigger Clear Register                   */
       uint32_t RESERVED2[60];
  __IO uint32_t PTOUT;             /*!< Port Output Enable Register for PSC          */
  __IO uint32_t PTCR;              /*!< Port Control Register for PSC                */
  __I  uint32_t PTIN;              /*!< Port Input Enable Register for PSC           */
} TSB_PSC_TypeDef;

#if defined ( __CC_ARM   )           /* RealView Compiler */
#pragma anon_unions
#elif (defined (__ICCARM__))         /*  ICC Compiler     */
#pragma language=extended
#endif

/**
  * @brief UART
  */
typedef struct
{
  __IO uint32_t DR;                /*!< Data Register                                */
union {
  __I  uint32_t RSR;               /*!< Receive Status Register                      */
  __O  uint32_t ECR;               /*!< Error Clear Register                         */
  };
       uint32_t RESERVED0[4];
  __I  uint32_t FR;                /*!< Flag Register                                */
       uint32_t RESERVED1[2];
  __IO uint32_t IBRD;              /*!< Integer Baud Rate Register                   */
  __IO uint32_t FBRD;              /*!< Fractional Baud Rate Register                */
  __IO uint32_t LCR_H;             /*!< Line Control Register                        */
  __IO uint32_t CR;                /*!< Control Register                             */
  __IO uint32_t IFLS;              /*!< Interrupt FIFO Level Select Register         */
  __IO uint32_t IMSC;              /*!< Interrupt Mask Set/Clear Register            */
  __I  uint32_t RIS;               /*!< Raw Interrupt Status Register                */
  __I  uint32_t MIS;               /*!< Masked Interrupt Status Register             */
  __O  uint32_t ICR;               /*!< Interrupt Clear Register                     */
  __IO uint32_t DMACR;             /*!< DMA Control Register                         */
} TSB_UART_TypeDef;

/**
  * @brief 12bit A/D Converter
  */
typedef struct
{
  __IO uint32_t CLK;               /*!< Conversion Clock Setting Register            */
  __O  uint32_t MOD0;              /*!< Mode Control Register0                       */
  __IO uint32_t MOD1;              /*!< Mode Control Register1                       */
  __IO uint32_t MOD2;              /*!< Mode Control Register2                       */
  __IO uint32_t MOD3;              /*!< Mode Control Register3                       */
  __IO uint32_t MOD4;              /*!< Mode Control Register4                       */
  __I  uint32_t MOD5;              /*!< Mode Control Register5                       */
  __IO uint32_t MOD6;              /*!< Mode Control Register6                       */
       uint32_t RESERVED0;
  __IO uint32_t CMPCR0;            /*!< Monitoring Interrupt Control Register0       */
  __IO uint32_t CMPCR1;            /*!< Monitoring Interrupt Control Register1       */
  __IO uint32_t CMP0;              /*!< Conversion Result Compare Register0          */
  __IO uint32_t CMP1;              /*!< Conversion Result Compare Register1          */
  __I  uint32_t REG00;             /*!< Conversion Result Store Register0            */
  __I  uint32_t REG01;             /*!< Conversion Result Store Register1            */
  __I  uint32_t REG02;             /*!< Conversion Result Store Register2            */
  __I  uint32_t REG03;             /*!< Conversion Result Store Register3            */
  __I  uint32_t REG04;             /*!< Conversion Result Store Register4            */
  __I  uint32_t REG05;             /*!< Conversion Result Store Register5            */
  __I  uint32_t REG06;             /*!< Conversion Result Store Register6            */
  __I  uint32_t REG07;             /*!< Conversion Result Store Register7            */
       uint32_t RESERVED1[8];
  __I  uint32_t REGSP;             /*!< Highest Priority Conversion Result Store Register*/
  __I  uint32_t CREG;              /*!< Conversion Result Store Common Register      */
} TSB_AD_TypeDef;

/**
  * @brief 12-bit AD converter(UnitB) Mirror
  */
typedef struct
{
       uint32_t RESERVED0[13];
  __I  uint32_t REG00;             /*!< Conversion Result Store Register0            */
  __I  uint32_t REG01;             /*!< Conversion Result Store Register1            */
  __I  uint32_t REG02;             /*!< Conversion Result Store Register2            */
  __I  uint32_t REG03;             /*!< Conversion Result Store Register3            */
  __I  uint32_t REG04;             /*!< Conversion Result Store Register4            */
  __I  uint32_t REG05;             /*!< Conversion Result Store Register5            */
  __I  uint32_t REG06;             /*!< Conversion Result Store Register6            */
  __I  uint32_t REG07;             /*!< Conversion Result Store Register7            */
       uint32_t RESERVED1[8];
  __I  uint32_t REGSP;             /*!< Highest Priority Conversion Result Store Register*/
  __I  uint32_t CREG;              /*!< Conversion Result Store Common Register      */
} TSB_ADB_PSC_TypeDef;

/**
  * @brief 12-bit AD converter(UnitC) Mirror
  */
typedef struct
{
       uint32_t RESERVED0[13];
  __I  uint32_t REG00;             /*!< Conversion Result Store Register0            */
  __I  uint32_t REG01;             /*!< Conversion Result Store Register1            */
  __I  uint32_t REG02;             /*!< Conversion Result Store Register2            */
  __I  uint32_t REG03;             /*!< Conversion Result Store Register3            */
  __I  uint32_t REG04;             /*!< Conversion Result Store Register4            */
  __I  uint32_t REG05;             /*!< Conversion Result Store Register5            */
  __I  uint32_t REG06;             /*!< Conversion Result Store Register6            */
  __I  uint32_t REG07;             /*!< Conversion Result Store Register7            */
       uint32_t RESERVED1[8];
  __I  uint32_t REGSP;             /*!< Highest Priority Conversion Result Store Register*/
  __I  uint32_t CREG;              /*!< Conversion Result Store Common Register      */
} TSB_ADC_PSC_TypeDef;

/**
  * @brief 12-bit AD converter(UnitA) Mirror
  */
typedef struct
{
       uint32_t RESERVED0[13];
  __I  uint32_t REG00;             /*!< Conversion Result Store Register0            */
  __I  uint32_t REG01;             /*!< Conversion Result Store Register1            */
  __I  uint32_t REG02;             /*!< Conversion Result Store Register2            */
  __I  uint32_t REG03;             /*!< Conversion Result Store Register3            */
  __I  uint32_t REG04;             /*!< Conversion Result Store Register4            */
  __I  uint32_t REG05;             /*!< Conversion Result Store Register5            */
  __I  uint32_t REG06;             /*!< Conversion Result Store Register6            */
  __I  uint32_t REG07;             /*!< Conversion Result Store Register7            */
       uint32_t RESERVED1[8];
  __I  uint32_t REGSP;             /*!< Highest Priority Conversion Result Store Register*/
  __I  uint32_t CREG;              /*!< Conversion Result Store Common Register      */
} TSB_ADA_PSC_TypeDef;

/**
  * @brief Timer D (Unit0 in BlockA)
  */
typedef struct
{
  __O  uint32_t RUN;               /*!< Timer Run Register (Unit0 in BlockA)         */
  __IO uint32_t CR;                /*!< Timer Control Register (Unit0 in BlockA)     */
  __IO uint32_t MOD;               /*!< Timer Mode Register (Unit0 in BlockA)        */
  __IO uint32_t DMA;               /*!< DMA Request Enable Register (Unit0 in BlockA)*/
       uint32_t RESERVED0;
  __IO uint32_t RG0;               /*!< Timer Register0 (Unit0 in BlockA)            */
  __IO uint32_t RG1;               /*!< Timer Register1 (Unit0 in BlockA)            */
  __IO uint32_t RG2;               /*!< Timer Register2 (Unit0 in BlockA)            */
  __IO uint32_t RG3;               /*!< Timer Register3 (Unit0 in BlockA)            */
  __IO uint32_t RG4;               /*!< Timer Register4 (Unit0 in BlockA)            */
  __IO uint32_t RG5;               /*!< Timer Register5 (Unit0 in BlockA)            */
       uint32_t RESERVED1[13];
  __IO uint32_t HSWB0;             /*!< H-SW Control Circuit Register Buffer0 (Unit0 in BlockA)*/
  __IO uint32_t HSWB1;             /*!< H-SW Control Circuit Register Buffer1 (Unit0 in BlockA)*/
       uint32_t RESERVED2[43];
  __I  uint32_t CP0;               /*!< Compare Register0 (Unit0 in BlockA)          */
  __I  uint32_t CP1;               /*!< Compare Register1 (Unit0 in BlockA)          */
  __I  uint32_t CP2;               /*!< Compare Register2 (Unit0 in BlockA)          */
  __I  uint32_t CP3;               /*!< Compare Register3 (Unit0 in BlockA)          */
  __I  uint32_t CP4;               /*!< Compare Register4 (Unit0 in BlockA)          */
  __I  uint32_t CP5;               /*!< Compare Register5 (Unit0 in BlockA)          */
       uint32_t RESERVED3[13];
  __I  uint32_t HSW0;              /*!< H-SW Control Circuit Register (Unit0 in BlockA)*/
  __I  uint32_t HSW1;              /*!< H-SW Control Circuit Register (Unit0 in BlockA)*/
} TSB_TDA0_TypeDef;

/**
  * @brief Timer D common (BlockA)
  */
typedef struct
{
  __IO uint32_t BCR;               /*!< Update Flag Setting Register (BlockA)        */
       uint32_t RESERVED0[3];
  __IO uint32_t EN;                /*!< Timer Enable Register (BlockA)               */
  __IO uint32_t CONF;              /*!< Timer Configuration Register (BlockA)        */
} TSB_TDA_TypeDef;

/**
  * @brief Timer D (Unit1 in BlockA)
  */
typedef struct
{
  __IO uint32_t RG0;               /*!< Timer Register0 (Unit1 in BlockA)            */
  __IO uint32_t RG1;               /*!< Timer Register1 (Unit1 in BlockA)            */
  __IO uint32_t RG2;               /*!< Timer Register2 (Unit1 in BlockA)            */
  __IO uint32_t RG3;               /*!< Timer Register3 (Unit1 in BlockA)            */
  __IO uint32_t RG4;               /*!< Timer Register4 (Unit1 in BlockA)            */
       uint32_t RESERVED0[10];
  __IO uint32_t HSWB0;             /*!< H-SW Control Circuit Register Buffer0 (Unit1 in BlockA)*/
  __IO uint32_t HSWB1;             /*!< H-SW Control Circuit Register Buffer1 (Unit1 in BlockA)*/
       uint32_t RESERVED1[36];
  __O  uint32_t RUN;               /*!< Timer Run Register (Unit1 in BlockA)         */
  __IO uint32_t CR;                /*!< Timer Control Register (Unit1 in BlockA)     */
  __IO uint32_t MOD;               /*!< Timer Mode Register (Unit1 in BlockA)        */
  __IO uint32_t DMA;               /*!< DMA Request Enable Register (Unit1 in BlockA)*/
       uint32_t RESERVED2[7];
  __I  uint32_t CP0;               /*!< Compare Register0 (Unit1 in BlockA)          */
  __I  uint32_t CP1;               /*!< Compare Register1 (Unit1 in BlockA)          */
  __I  uint32_t CP2;               /*!< Compare Register2 (Unit1 in BlockA)          */
  __I  uint32_t CP3;               /*!< Compare Register3 (Unit1 in BlockA)          */
  __I  uint32_t CP4;               /*!< Compare Register4 (Unit1 in BlockA)          */
       uint32_t RESERVED3[19];
  __I  uint32_t HSW0;              /*!< H-SW Control Circuit Register (Unit1 in BlockA)*/
  __I  uint32_t HSW1;              /*!< H-SW Control Circuit Register (Unit1 in BlockA)*/
} TSB_TDA1_TypeDef;

/**
  * @brief Timer D (Unit0 in BlockB)
  */
typedef struct
{
  __O  uint32_t RUN;               /*!< Timer Run Register (Unit0 in BlockB)         */
  __IO uint32_t CR;                /*!< Timer Control Register (Unit0 in BlockB)     */
  __IO uint32_t MOD;               /*!< Timer Mode Register (Unit0 in BlockB)        */
  __IO uint32_t DMA;               /*!< DMA Request Enable Register (Unit0 in BlockB)*/
       uint32_t RESERVED0;
  __IO uint32_t RG0;               /*!< Timer Register0 (Unit0 in BlockB)            */
  __IO uint32_t RG1;               /*!< Timer Register1 (Unit0 in BlockB)            */
  __IO uint32_t RG2;               /*!< Timer Register2 (Unit0 in BlockB)            */
  __IO uint32_t RG3;               /*!< Timer Register3 (Unit0 in BlockB)            */
  __IO uint32_t RG4;               /*!< Timer Register4 (Unit0 in BlockB)            */
  __IO uint32_t RG5;               /*!< Timer Register5 (Unit0 in BlockB)            */
       uint32_t RESERVED1[13];
  __IO uint32_t HSWB0;             /*!< H-SW Control Circuit Register Buffer0 (Unit0 in BlockB)*/
  __IO uint32_t HSWB1;             /*!< H-SW Control Circuit Register Buffer1 (Unit0 in BlockB)*/
       uint32_t RESERVED2[43];
  __I  uint32_t CP0;               /*!< Compare Register0 (Unit0 in BlockB)          */
  __I  uint32_t CP1;               /*!< Compare Register1 (Unit0 in BlockB)          */
  __I  uint32_t CP2;               /*!< Compare Register2 (Unit0 in BlockB)          */
  __I  uint32_t CP3;               /*!< Compare Register3 (Unit0 in BlockB)          */
  __I  uint32_t CP4;               /*!< Compare Register4 (Unit0 in BlockB)          */
  __I  uint32_t CP5;               /*!< Compare Register5 (Unit0 in BlockB)          */
       uint32_t RESERVED3[13];
  __I  uint32_t HSW0;              /*!< H-SW Control Circuit Register (Unit0 in BlockB)*/
  __I  uint32_t HSW1;              /*!< H-SW Control Circuit Register (Unit0 in BlockB)*/
} TSB_TDB0_TypeDef;

/**
  * @brief Timer D common (BlockB)
  */
typedef struct
{
  __IO uint32_t BCR;               /*!< Update Flag Setting Register (BlockB)        */
       uint32_t RESERVED0[3];
  __IO uint32_t EN;                /*!< Timer Enable Register (BlockB)               */
  __IO uint32_t CONF;              /*!< Timer Configuration Register (BlockB)        */
} TSB_TDB_TypeDef;

/**
  * @brief Timer D (Unit1 in BlockB)
  */
typedef struct
{
  __IO uint32_t RG0;               /*!< Timer Register0 (Unit1 in BlockB)            */
  __IO uint32_t RG1;               /*!< Timer Register1 (Unit1 in BlockB)            */
  __IO uint32_t RG2;               /*!< Timer Register2 (Unit1 in BlockB)            */
  __IO uint32_t RG3;               /*!< Timer Register3 (Unit1 in BlockB)            */
  __IO uint32_t RG4;               /*!< Timer Register4 (Unit1 in BlockB)            */
       uint32_t RESERVED0[10];
  __IO uint32_t HSWB0;             /*!< H-SW Control Circuit Register Buffer0 (Unit1 in BlockB)*/
  __IO uint32_t HSWB1;             /*!< H-SW Control Circuit Register Buffer1 (Unit1 in BlockB)*/
       uint32_t RESERVED1[36];
  __O  uint32_t RUN;               /*!< Timer Run Register (Unit1 in BlockB)         */
  __IO uint32_t CR;                /*!< Timer Control Register (Unit1 in BlockB)     */
  __IO uint32_t MOD;               /*!< Timer Mode Register (Unit1 in BlockB)        */
  __IO uint32_t DMA;               /*!< DMA Request Enable Register (Unit1 in BlockB)*/
       uint32_t RESERVED2[7];
  __I  uint32_t CP0;               /*!< Compare Register0 (Unit1 in BlockB)          */
  __I  uint32_t CP1;               /*!< Compare Register1 (Unit1 in BlockB)          */
  __I  uint32_t CP2;               /*!< Compare Register2 (Unit1 in BlockB)          */
  __I  uint32_t CP3;               /*!< Compare Register3 (Unit1 in BlockB)          */
  __I  uint32_t CP4;               /*!< Compare Register4 (Unit1 in BlockB)          */
       uint32_t RESERVED3[19];
  __I  uint32_t HSW0;              /*!< H-SW Control Circuit Register (Unit1 in BlockB)*/
  __I  uint32_t HSW1;              /*!< H-SW Control Circuit Register (Unit1 in BlockB)*/
} TSB_TDB1_TypeDef;

/**
  * @brief Enhannced two aspect pulse input counter (EPHC)
  */
typedef struct
{
  __IO uint32_t EN;                /*!< EPHC Enable Register                         */
  __IO uint32_t CNT;               /*!< EPHC Control Register                        */
  __IO uint32_t IE;                /*!< EPHC Interrupt Enable Register               */
  __IO uint32_t FLG;               /*!< EPHC Status Register                         */
  __IO uint32_t ARUN;              /*!< EPHC 16-bit Counter Run Register             */
  __IO uint32_t ACP0;              /*!< EPHC Pulse Counter Compare 0 Register        */
  __IO uint32_t ACP1;              /*!< EPHC Pulse Counter Compare 1 Register        */
  __IO uint32_t ADAT;              /*!< EPHC 16-bit Counter Read Register            */
  __IO uint32_t BRUN;              /*!< EPHC 24-bit Counter Run Register             */
  __IO uint32_t BDMA;              /*!< EPHC DMAE Request Enable Register            */
  __I  uint32_t BUC;               /*!< EPHC 24-bit Counter Read Register            */
       uint32_t RESERVED0;
  __I  uint32_t BCAP00;            /*!< EPHC Capture 00 Register                     */
  __I  uint32_t BCAP10;            /*!< EPHC Capture 10 Register                     */
  __I  uint32_t BCAP20;            /*!< EPHC Capture 20 Register                     */
  __I  uint32_t BCAP30;            /*!< EPHC Capture 30 Register                     */
  __I  uint32_t B0DAT;             /*!< EPHC Cycle 0 Register                        */
  __I  uint32_t B1DAT;             /*!< EPHC Cycle 1 Register                        */
  __I  uint32_t B2DAT;             /*!< EPHC Cycle 2 Register                        */
  __I  uint32_t B3DAT;             /*!< EPHC Cycle 3 Register                        */
  __I  uint32_t BCDAT;             /*!< EPHC Cycle Common Register                   */
       uint32_t RESERVED1[3];
  __I  uint32_t B0PDT;             /*!< EPHC Phase DifferEPHCe 0 Register            */
  __I  uint32_t B1PDT;             /*!< EPHC Phase DifferEPHCe 1 Register            */
  __I  uint32_t B2PDT;             /*!< EPHC Phase DifferEPHCe 2 Register            */
  __I  uint32_t B3PDT;             /*!< EPHC Phase DifferEPHCe 3 Register            */
  __IO uint32_t UPLMT;             /*!< EPHC Upper Cycle Limit Value Register        */
  __IO uint32_t LWLMT;             /*!< EPHC Lower Cycle Limit Value Register        */
} TSB_EPHC_TypeDef;

