MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM343FEXBG/mcu.h
/* Programmable Servo Controller  */
#define TSB_PSCA_SGN_SA0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->SGN,16)))
#define TSB_PSCA_SGN_SM0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->SGN,17)))
#define TSB_PSCA_SGN_SM1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->SGN,18)))
#define TSB_PSCA_SGN_SL0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->SGN,19)))
#define TSB_PSCA_SGN_SL1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->SGN,20)))
#define TSB_PSCA_SGN_SR0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->SGN,21)))
#define TSB_PSCA_SGN_SR1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->SGN,22)))
#define TSB_PSCA_CNT_START                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->CNT,16)))
#define TSB_PSCA_CNT_STEP                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->CNT,24)))
#define TSB_PSCA_CNT_BRK                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->CNT,25)))
#define TSB_PSCA_FLG_OVER                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->FLG,16)))
#define TSB_PSCA_FLG_UNDER                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->FLG,17)))
#define TSB_PSCA_FLG_ZERO                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->FLG,24)))
#define TSB_PSCA_REN_INTEN0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->REN,0)))
#define TSB_PSCA_REN_INTEN1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->REN,1)))
#define TSB_PSCA_REN_INTEN2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->REN,2)))
#define TSB_PSCA_REN_INTEN3                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->REN,3)))
#define TSB_PSCA_REN_INTEN4                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->REN,4)))
#define TSB_PSCA_REN_INTEN5                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->REN,5)))
#define TSB_PSCA_REN_INTEN6                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->REN,6)))
#define TSB_PSCA_REN_INTEN7                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->REN,7)))
#define TSB_PSCA_REN_INTEN8                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->REN,8)))
#define TSB_PSCA_REN_INTEN9                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->REN,9)))
#define TSB_PSCA_REN_INTEN10                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->REN,10)))
#define TSB_PSCA_REN_INTEN11                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->REN,11)))
#define TSB_PSCA_REN_INTEN12                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->REN,12)))
#define TSB_PSCA_REN_INTEN13                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->REN,13)))
#define TSB_PSCA_REN_INTEN14                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->REN,14)))
#define TSB_PSCA_REN_INTEN15                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->REN,15)))
#define TSB_PSCA_REN_INTEG0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->REN,16)))
#define TSB_PSCA_REN_INTEG1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->REN,17)))
#define TSB_PSCA_REN_INTEG2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->REN,18)))
#define TSB_PSCA_REN_INTEG3                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCA->REN,19)))
#define TSB_PSCA_RFLG_INTFLG0                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,0)))
#define TSB_PSCA_RFLG_INTFLG1                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,1)))
#define TSB_PSCA_RFLG_INTFLG2                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,2)))
#define TSB_PSCA_RFLG_INTFLG3                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,3)))
#define TSB_PSCA_RFLG_INTFLG4                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,4)))
#define TSB_PSCA_RFLG_INTFLG5                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,5)))
#define TSB_PSCA_RFLG_INTFLG6                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,6)))
#define TSB_PSCA_RFLG_INTFLG7                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,7)))
#define TSB_PSCA_RFLG_INTFLG8                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,8)))
#define TSB_PSCA_RFLG_INTFLG9                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,9)))
#define TSB_PSCA_RFLG_INTFLG10                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,10)))
#define TSB_PSCA_RFLG_INTFLG11                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,11)))
#define TSB_PSCA_RFLG_INTFLG12                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,12)))
#define TSB_PSCA_RFLG_INTFLG13                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,13)))
#define TSB_PSCA_RFLG_INTFLG14                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,14)))
#define TSB_PSCA_RFLG_INTFLG15                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,15)))
#define TSB_PSCA_RFLG_INTOVRF0                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,16)))
#define TSB_PSCA_RFLG_INTOVRF1                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,17)))
#define TSB_PSCA_RFLG_INTOVRF2                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,18)))
#define TSB_PSCA_RFLG_INTOVRF3                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,19)))
#define TSB_PSCA_RFLG_INTOVRF4                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,20)))
#define TSB_PSCA_RFLG_INTOVRF5                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,21)))
#define TSB_PSCA_RFLG_INTOVRF6                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,22)))
#define TSB_PSCA_RFLG_INTOVRF7                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,23)))
#define TSB_PSCA_RFLG_INTOVRF8                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,24)))
#define TSB_PSCA_RFLG_INTOVRF9                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,25)))
#define TSB_PSCA_RFLG_INTOVRF10                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,26)))
#define TSB_PSCA_RFLG_INTOVRF11                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,27)))
#define TSB_PSCA_RFLG_INTOVRF12                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,28)))
#define TSB_PSCA_RFLG_INTOVRF13                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,29)))
#define TSB_PSCA_RFLG_INTOVRF14                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,30)))
#define TSB_PSCA_RFLG_INTOVRF15                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCA->RFLG,31)))
#define TSB_PSCA_RCLR_INTCLR0                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RCLR,0)))
#define TSB_PSCA_RCLR_INTCLR1                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RCLR,1)))
#define TSB_PSCA_RCLR_INTCLR2                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RCLR,2)))
#define TSB_PSCA_RCLR_INTCLR3                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RCLR,3)))
#define TSB_PSCA_RCLR_INTCLR4                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RCLR,4)))
#define TSB_PSCA_RCLR_INTCLR5                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RCLR,5)))
#define TSB_PSCA_RCLR_INTCLR6                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RCLR,6)))
#define TSB_PSCA_RCLR_INTCLR7                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RCLR,7)))
#define TSB_PSCA_RCLR_INTCLR8                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RCLR,8)))
#define TSB_PSCA_RCLR_INTCLR9                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RCLR,9)))
#define TSB_PSCA_RCLR_INTCLR10                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RCLR,10)))
#define TSB_PSCA_RCLR_INTCLR11                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RCLR,11)))
#define TSB_PSCA_RCLR_INTCLR12                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RCLR,12)))
#define TSB_PSCA_RCLR_INTCLR13                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RCLR,13)))
#define TSB_PSCA_RCLR_INTCLR14                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RCLR,14)))
#define TSB_PSCA_RCLR_INTCLR15                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RCLR,15)))
#define TSB_PSCA_RSET_INTSET0                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RSET,0)))
#define TSB_PSCA_RSET_INTSET1                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RSET,1)))
#define TSB_PSCA_RSET_INTSET2                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RSET,2)))
#define TSB_PSCA_RSET_INTSET3                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RSET,3)))
#define TSB_PSCA_RSET_INTSET4                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RSET,4)))
#define TSB_PSCA_RSET_INTSET5                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RSET,5)))
#define TSB_PSCA_RSET_INTSET6                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RSET,6)))
#define TSB_PSCA_RSET_INTSET7                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RSET,7)))
#define TSB_PSCA_RSET_INTSET8                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RSET,8)))
#define TSB_PSCA_RSET_INTSET9                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RSET,9)))
#define TSB_PSCA_RSET_INTSET10                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RSET,10)))
#define TSB_PSCA_RSET_INTSET11                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RSET,11)))
#define TSB_PSCA_RSET_INTSET12                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RSET,12)))
#define TSB_PSCA_RSET_INTSET13                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RSET,13)))
#define TSB_PSCA_RSET_INTSET14                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RSET,14)))
#define TSB_PSCA_RSET_INTSET15                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCA->RSET,15)))

