MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM343FEXBG/mcu.h
#define TSB_PSCB_SGN_SA0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->SGN,16)))
#define TSB_PSCB_SGN_SM0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->SGN,17)))
#define TSB_PSCB_SGN_SM1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->SGN,18)))
#define TSB_PSCB_SGN_SL0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->SGN,19)))
#define TSB_PSCB_SGN_SL1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->SGN,20)))
#define TSB_PSCB_SGN_SR0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->SGN,21)))
#define TSB_PSCB_SGN_SR1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->SGN,22)))
#define TSB_PSCB_CNT_START                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->CNT,16)))
#define TSB_PSCB_CNT_STEP                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->CNT,24)))
#define TSB_PSCB_CNT_BRK                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->CNT,25)))
#define TSB_PSCB_FLG_OVER                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->FLG,16)))
#define TSB_PSCB_FLG_UNDER                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->FLG,17)))
#define TSB_PSCB_FLG_ZERO                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->FLG,24)))
#define TSB_PSCB_REN_INTEN0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->REN,0)))
#define TSB_PSCB_REN_INTEN1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->REN,1)))
#define TSB_PSCB_REN_INTEN2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->REN,2)))
#define TSB_PSCB_REN_INTEN3                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->REN,3)))
#define TSB_PSCB_REN_INTEN4                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->REN,4)))
#define TSB_PSCB_REN_INTEN5                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->REN,5)))
#define TSB_PSCB_REN_INTEN6                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->REN,6)))
#define TSB_PSCB_REN_INTEN7                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->REN,7)))
#define TSB_PSCB_REN_INTEN8                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->REN,8)))
#define TSB_PSCB_REN_INTEN9                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->REN,9)))
#define TSB_PSCB_REN_INTEN10                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->REN,10)))
#define TSB_PSCB_REN_INTEN11                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->REN,11)))
#define TSB_PSCB_REN_INTEN12                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->REN,12)))
#define TSB_PSCB_REN_INTEN13                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->REN,13)))
#define TSB_PSCB_REN_INTEN14                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->REN,14)))
#define TSB_PSCB_REN_INTEN15                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->REN,15)))
#define TSB_PSCB_REN_INTEG0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->REN,16)))
#define TSB_PSCB_REN_INTEG1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->REN,17)))
#define TSB_PSCB_REN_INTEG2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->REN,18)))
#define TSB_PSCB_REN_INTEG3                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCB->REN,19)))
#define TSB_PSCB_RFLG_INTFLG0                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,0)))
#define TSB_PSCB_RFLG_INTFLG1                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,1)))
#define TSB_PSCB_RFLG_INTFLG2                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,2)))
#define TSB_PSCB_RFLG_INTFLG3                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,3)))
#define TSB_PSCB_RFLG_INTFLG4                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,4)))
#define TSB_PSCB_RFLG_INTFLG5                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,5)))
#define TSB_PSCB_RFLG_INTFLG6                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,6)))
#define TSB_PSCB_RFLG_INTFLG7                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,7)))
#define TSB_PSCB_RFLG_INTFLG8                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,8)))
#define TSB_PSCB_RFLG_INTFLG9                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,9)))
#define TSB_PSCB_RFLG_INTFLG10                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,10)))
#define TSB_PSCB_RFLG_INTFLG11                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,11)))
#define TSB_PSCB_RFLG_INTFLG12                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,12)))
#define TSB_PSCB_RFLG_INTFLG13                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,13)))
#define TSB_PSCB_RFLG_INTFLG14                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,14)))
#define TSB_PSCB_RFLG_INTFLG15                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,15)))
#define TSB_PSCB_RFLG_INTOVRF0                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,16)))
#define TSB_PSCB_RFLG_INTOVRF1                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,17)))
#define TSB_PSCB_RFLG_INTOVRF2                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,18)))
#define TSB_PSCB_RFLG_INTOVRF3                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,19)))
#define TSB_PSCB_RFLG_INTOVRF4                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,20)))
#define TSB_PSCB_RFLG_INTOVRF5                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,21)))
#define TSB_PSCB_RFLG_INTOVRF6                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,22)))
#define TSB_PSCB_RFLG_INTOVRF7                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,23)))
#define TSB_PSCB_RFLG_INTOVRF8                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,24)))
#define TSB_PSCB_RFLG_INTOVRF9                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,25)))
#define TSB_PSCB_RFLG_INTOVRF10                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,26)))
#define TSB_PSCB_RFLG_INTOVRF11                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,27)))
#define TSB_PSCB_RFLG_INTOVRF12                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,28)))
#define TSB_PSCB_RFLG_INTOVRF13                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,29)))
#define TSB_PSCB_RFLG_INTOVRF14                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,30)))
#define TSB_PSCB_RFLG_INTOVRF15                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCB->RFLG,31)))
#define TSB_PSCB_RCLR_INTCLR0                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RCLR,0)))
#define TSB_PSCB_RCLR_INTCLR1                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RCLR,1)))
#define TSB_PSCB_RCLR_INTCLR2                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RCLR,2)))
#define TSB_PSCB_RCLR_INTCLR3                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RCLR,3)))
#define TSB_PSCB_RCLR_INTCLR4                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RCLR,4)))
#define TSB_PSCB_RCLR_INTCLR5                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RCLR,5)))
#define TSB_PSCB_RCLR_INTCLR6                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RCLR,6)))
#define TSB_PSCB_RCLR_INTCLR7                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RCLR,7)))
#define TSB_PSCB_RCLR_INTCLR8                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RCLR,8)))
#define TSB_PSCB_RCLR_INTCLR9                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RCLR,9)))
#define TSB_PSCB_RCLR_INTCLR10                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RCLR,10)))
#define TSB_PSCB_RCLR_INTCLR11                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RCLR,11)))
#define TSB_PSCB_RCLR_INTCLR12                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RCLR,12)))
#define TSB_PSCB_RCLR_INTCLR13                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RCLR,13)))
#define TSB_PSCB_RCLR_INTCLR14                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RCLR,14)))
#define TSB_PSCB_RCLR_INTCLR15                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RCLR,15)))
#define TSB_PSCB_RSET_INTSET0                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RSET,0)))
#define TSB_PSCB_RSET_INTSET1                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RSET,1)))
#define TSB_PSCB_RSET_INTSET2                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RSET,2)))
#define TSB_PSCB_RSET_INTSET3                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RSET,3)))
#define TSB_PSCB_RSET_INTSET4                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RSET,4)))
#define TSB_PSCB_RSET_INTSET5                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RSET,5)))
#define TSB_PSCB_RSET_INTSET6                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RSET,6)))
#define TSB_PSCB_RSET_INTSET7                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RSET,7)))
#define TSB_PSCB_RSET_INTSET8                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RSET,8)))
#define TSB_PSCB_RSET_INTSET9                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RSET,9)))
#define TSB_PSCB_RSET_INTSET10                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RSET,10)))
#define TSB_PSCB_RSET_INTSET11                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RSET,11)))
#define TSB_PSCB_RSET_INTSET12                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RSET,12)))
#define TSB_PSCB_RSET_INTSET13                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RSET,13)))
#define TSB_PSCB_RSET_INTSET14                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RSET,14)))
#define TSB_PSCB_RSET_INTSET15                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCB->RSET,15)))

#define TSB_PSCC_SGN_SA0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->SGN,16)))
#define TSB_PSCC_SGN_SM0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->SGN,17)))
#define TSB_PSCC_SGN_SM1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->SGN,18)))
#define TSB_PSCC_SGN_SL0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->SGN,19)))
#define TSB_PSCC_SGN_SL1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->SGN,20)))
#define TSB_PSCC_SGN_SR0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->SGN,21)))
#define TSB_PSCC_SGN_SR1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->SGN,22)))
#define TSB_PSCC_CNT_START                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->CNT,16)))
#define TSB_PSCC_CNT_STEP                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->CNT,24)))
#define TSB_PSCC_CNT_BRK                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->CNT,25)))
#define TSB_PSCC_FLG_OVER                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->FLG,16)))
#define TSB_PSCC_FLG_UNDER                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->FLG,17)))
#define TSB_PSCC_FLG_ZERO                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->FLG,24)))
#define TSB_PSCC_REN_INTEN0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->REN,0)))
#define TSB_PSCC_REN_INTEN1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->REN,1)))
#define TSB_PSCC_REN_INTEN2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->REN,2)))
#define TSB_PSCC_REN_INTEN3                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->REN,3)))
#define TSB_PSCC_REN_INTEN4                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->REN,4)))
#define TSB_PSCC_REN_INTEN5                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->REN,5)))
#define TSB_PSCC_REN_INTEN6                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->REN,6)))
#define TSB_PSCC_REN_INTEN7                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->REN,7)))
#define TSB_PSCC_REN_INTEN8                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->REN,8)))
#define TSB_PSCC_REN_INTEN9                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->REN,9)))
#define TSB_PSCC_REN_INTEN10                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->REN,10)))
#define TSB_PSCC_REN_INTEN11                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->REN,11)))
#define TSB_PSCC_REN_INTEN12                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->REN,12)))
#define TSB_PSCC_REN_INTEN13                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->REN,13)))
#define TSB_PSCC_REN_INTEN14                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->REN,14)))
#define TSB_PSCC_REN_INTEN15                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->REN,15)))
#define TSB_PSCC_REN_INTEG0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->REN,16)))
#define TSB_PSCC_REN_INTEG1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->REN,17)))
#define TSB_PSCC_REN_INTEG2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->REN,18)))
#define TSB_PSCC_REN_INTEG3                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCC->REN,19)))
#define TSB_PSCC_RFLG_INTFLG0                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,0)))
#define TSB_PSCC_RFLG_INTFLG1                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,1)))
#define TSB_PSCC_RFLG_INTFLG2                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,2)))
#define TSB_PSCC_RFLG_INTFLG3                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,3)))
#define TSB_PSCC_RFLG_INTFLG4                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,4)))
#define TSB_PSCC_RFLG_INTFLG5                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,5)))
#define TSB_PSCC_RFLG_INTFLG6                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,6)))
#define TSB_PSCC_RFLG_INTFLG7                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,7)))
#define TSB_PSCC_RFLG_INTFLG8                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,8)))
#define TSB_PSCC_RFLG_INTFLG9                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,9)))
#define TSB_PSCC_RFLG_INTFLG10                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,10)))
#define TSB_PSCC_RFLG_INTFLG11                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,11)))
#define TSB_PSCC_RFLG_INTFLG12                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,12)))
#define TSB_PSCC_RFLG_INTFLG13                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,13)))
#define TSB_PSCC_RFLG_INTFLG14                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,14)))
#define TSB_PSCC_RFLG_INTFLG15                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,15)))
#define TSB_PSCC_RFLG_INTOVRF0                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,16)))
#define TSB_PSCC_RFLG_INTOVRF1                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,17)))
#define TSB_PSCC_RFLG_INTOVRF2                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,18)))
#define TSB_PSCC_RFLG_INTOVRF3                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,19)))
#define TSB_PSCC_RFLG_INTOVRF4                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,20)))
#define TSB_PSCC_RFLG_INTOVRF5                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,21)))
#define TSB_PSCC_RFLG_INTOVRF6                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,22)))
#define TSB_PSCC_RFLG_INTOVRF7                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,23)))
#define TSB_PSCC_RFLG_INTOVRF8                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,24)))
#define TSB_PSCC_RFLG_INTOVRF9                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,25)))
#define TSB_PSCC_RFLG_INTOVRF10                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,26)))
#define TSB_PSCC_RFLG_INTOVRF11                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,27)))
#define TSB_PSCC_RFLG_INTOVRF12                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,28)))
#define TSB_PSCC_RFLG_INTOVRF13                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,29)))
#define TSB_PSCC_RFLG_INTOVRF14                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,30)))
#define TSB_PSCC_RFLG_INTOVRF15                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCC->RFLG,31)))
#define TSB_PSCC_RCLR_INTCLR0                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RCLR,0)))
#define TSB_PSCC_RCLR_INTCLR1                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RCLR,1)))
#define TSB_PSCC_RCLR_INTCLR2                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RCLR,2)))
#define TSB_PSCC_RCLR_INTCLR3                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RCLR,3)))
#define TSB_PSCC_RCLR_INTCLR4                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RCLR,4)))
#define TSB_PSCC_RCLR_INTCLR5                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RCLR,5)))
#define TSB_PSCC_RCLR_INTCLR6                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RCLR,6)))
#define TSB_PSCC_RCLR_INTCLR7                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RCLR,7)))
#define TSB_PSCC_RCLR_INTCLR8                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RCLR,8)))
#define TSB_PSCC_RCLR_INTCLR9                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RCLR,9)))
#define TSB_PSCC_RCLR_INTCLR10                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RCLR,10)))
#define TSB_PSCC_RCLR_INTCLR11                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RCLR,11)))
#define TSB_PSCC_RCLR_INTCLR12                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RCLR,12)))
#define TSB_PSCC_RCLR_INTCLR13                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RCLR,13)))
#define TSB_PSCC_RCLR_INTCLR14                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RCLR,14)))
#define TSB_PSCC_RCLR_INTCLR15                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RCLR,15)))
#define TSB_PSCC_RSET_INTSET0                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RSET,0)))
#define TSB_PSCC_RSET_INTSET1                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RSET,1)))
#define TSB_PSCC_RSET_INTSET2                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RSET,2)))
#define TSB_PSCC_RSET_INTSET3                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RSET,3)))
#define TSB_PSCC_RSET_INTSET4                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RSET,4)))
#define TSB_PSCC_RSET_INTSET5                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RSET,5)))
#define TSB_PSCC_RSET_INTSET6                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RSET,6)))
#define TSB_PSCC_RSET_INTSET7                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RSET,7)))
#define TSB_PSCC_RSET_INTSET8                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RSET,8)))
#define TSB_PSCC_RSET_INTSET9                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RSET,9)))
#define TSB_PSCC_RSET_INTSET10                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RSET,10)))
#define TSB_PSCC_RSET_INTSET11                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RSET,11)))
#define TSB_PSCC_RSET_INTSET12                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RSET,12)))
#define TSB_PSCC_RSET_INTSET13                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RSET,13)))
#define TSB_PSCC_RSET_INTSET14                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RSET,14)))
#define TSB_PSCC_RSET_INTSET15                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCC->RSET,15)))

