MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM343FEXBG/mcu.h
#define TSB_PSCD_SGN_SA0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->SGN,16)))
#define TSB_PSCD_SGN_SM0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->SGN,17)))
#define TSB_PSCD_SGN_SM1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->SGN,18)))
#define TSB_PSCD_SGN_SL0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->SGN,19)))
#define TSB_PSCD_SGN_SL1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->SGN,20)))
#define TSB_PSCD_SGN_SR0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->SGN,21)))
#define TSB_PSCD_SGN_SR1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->SGN,22)))
#define TSB_PSCD_CNT_START                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->CNT,16)))
#define TSB_PSCD_CNT_STEP                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->CNT,24)))
#define TSB_PSCD_CNT_BRK                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->CNT,25)))
#define TSB_PSCD_FLG_OVER                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->FLG,16)))
#define TSB_PSCD_FLG_UNDER                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->FLG,17)))
#define TSB_PSCD_FLG_ZERO                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->FLG,24)))
#define TSB_PSCD_REN_INTEN0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->REN,0)))
#define TSB_PSCD_REN_INTEN1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->REN,1)))
#define TSB_PSCD_REN_INTEN2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->REN,2)))
#define TSB_PSCD_REN_INTEN3                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->REN,3)))
#define TSB_PSCD_REN_INTEN4                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->REN,4)))
#define TSB_PSCD_REN_INTEN5                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->REN,5)))
#define TSB_PSCD_REN_INTEN6                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->REN,6)))
#define TSB_PSCD_REN_INTEN7                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->REN,7)))
#define TSB_PSCD_REN_INTEN8                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->REN,8)))
#define TSB_PSCD_REN_INTEN9                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->REN,9)))
#define TSB_PSCD_REN_INTEN10                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->REN,10)))
#define TSB_PSCD_REN_INTEN11                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->REN,11)))
#define TSB_PSCD_REN_INTEN12                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->REN,12)))
#define TSB_PSCD_REN_INTEN13                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->REN,13)))
#define TSB_PSCD_REN_INTEN14                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->REN,14)))
#define TSB_PSCD_REN_INTEN15                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->REN,15)))
#define TSB_PSCD_REN_INTEG0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->REN,16)))
#define TSB_PSCD_REN_INTEG1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->REN,17)))
#define TSB_PSCD_REN_INTEG2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->REN,18)))
#define TSB_PSCD_REN_INTEG3                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PSCD->REN,19)))
#define TSB_PSCD_RFLG_INTFLG0                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,0)))
#define TSB_PSCD_RFLG_INTFLG1                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,1)))
#define TSB_PSCD_RFLG_INTFLG2                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,2)))
#define TSB_PSCD_RFLG_INTFLG3                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,3)))
#define TSB_PSCD_RFLG_INTFLG4                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,4)))
#define TSB_PSCD_RFLG_INTFLG5                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,5)))
#define TSB_PSCD_RFLG_INTFLG6                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,6)))
#define TSB_PSCD_RFLG_INTFLG7                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,7)))
#define TSB_PSCD_RFLG_INTFLG8                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,8)))
#define TSB_PSCD_RFLG_INTFLG9                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,9)))
#define TSB_PSCD_RFLG_INTFLG10                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,10)))
#define TSB_PSCD_RFLG_INTFLG11                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,11)))
#define TSB_PSCD_RFLG_INTFLG12                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,12)))
#define TSB_PSCD_RFLG_INTFLG13                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,13)))
#define TSB_PSCD_RFLG_INTFLG14                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,14)))
#define TSB_PSCD_RFLG_INTFLG15                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,15)))
#define TSB_PSCD_RFLG_INTOVRF0                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,16)))
#define TSB_PSCD_RFLG_INTOVRF1                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,17)))
#define TSB_PSCD_RFLG_INTOVRF2                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,18)))
#define TSB_PSCD_RFLG_INTOVRF3                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,19)))
#define TSB_PSCD_RFLG_INTOVRF4                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,20)))
#define TSB_PSCD_RFLG_INTOVRF5                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,21)))
#define TSB_PSCD_RFLG_INTOVRF6                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,22)))
#define TSB_PSCD_RFLG_INTOVRF7                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,23)))
#define TSB_PSCD_RFLG_INTOVRF8                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,24)))
#define TSB_PSCD_RFLG_INTOVRF9                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,25)))
#define TSB_PSCD_RFLG_INTOVRF10                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,26)))
#define TSB_PSCD_RFLG_INTOVRF11                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,27)))
#define TSB_PSCD_RFLG_INTOVRF12                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,28)))
#define TSB_PSCD_RFLG_INTOVRF13                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,29)))
#define TSB_PSCD_RFLG_INTOVRF14                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,30)))
#define TSB_PSCD_RFLG_INTOVRF15                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_PSCD->RFLG,31)))
#define TSB_PSCD_RCLR_INTCLR0                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RCLR,0)))
#define TSB_PSCD_RCLR_INTCLR1                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RCLR,1)))
#define TSB_PSCD_RCLR_INTCLR2                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RCLR,2)))
#define TSB_PSCD_RCLR_INTCLR3                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RCLR,3)))
#define TSB_PSCD_RCLR_INTCLR4                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RCLR,4)))
#define TSB_PSCD_RCLR_INTCLR5                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RCLR,5)))
#define TSB_PSCD_RCLR_INTCLR6                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RCLR,6)))
#define TSB_PSCD_RCLR_INTCLR7                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RCLR,7)))
#define TSB_PSCD_RCLR_INTCLR8                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RCLR,8)))
#define TSB_PSCD_RCLR_INTCLR9                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RCLR,9)))
#define TSB_PSCD_RCLR_INTCLR10                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RCLR,10)))
#define TSB_PSCD_RCLR_INTCLR11                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RCLR,11)))
#define TSB_PSCD_RCLR_INTCLR12                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RCLR,12)))
#define TSB_PSCD_RCLR_INTCLR13                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RCLR,13)))
#define TSB_PSCD_RCLR_INTCLR14                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RCLR,14)))
#define TSB_PSCD_RCLR_INTCLR15                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RCLR,15)))
#define TSB_PSCD_RSET_INTSET0                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RSET,0)))
#define TSB_PSCD_RSET_INTSET1                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RSET,1)))
#define TSB_PSCD_RSET_INTSET2                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RSET,2)))
#define TSB_PSCD_RSET_INTSET3                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RSET,3)))
#define TSB_PSCD_RSET_INTSET4                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RSET,4)))
#define TSB_PSCD_RSET_INTSET5                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RSET,5)))
#define TSB_PSCD_RSET_INTSET6                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RSET,6)))
#define TSB_PSCD_RSET_INTSET7                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RSET,7)))
#define TSB_PSCD_RSET_INTSET8                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RSET,8)))
#define TSB_PSCD_RSET_INTSET9                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RSET,9)))
#define TSB_PSCD_RSET_INTSET10                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RSET,10)))
#define TSB_PSCD_RSET_INTSET11                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RSET,11)))
#define TSB_PSCD_RSET_INTSET12                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RSET,12)))
#define TSB_PSCD_RSET_INTSET13                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RSET,13)))
#define TSB_PSCD_RSET_INTSET14                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RSET,14)))
#define TSB_PSCD_RSET_INTSET15                    (*((__O  uint32_t *)BITBAND_PERI(&TSB_PSCD->RSET,15)))


/* UART */
#define TSB_UART_DR_FE                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->DR,8)))
#define TSB_UART_DR_PE                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->DR,9)))
#define TSB_UART_DR_BE                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->DR,10)))
#define TSB_UART_DR_OE                            (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->DR,11)))
#define TSB_UART_RSR_FE                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->RSR,0)))
#define TSB_UART_RSR_PE                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->RSR,1)))
#define TSB_UART_RSR_BE                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->RSR,2)))
#define TSB_UART_RSR_OE                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->RSR,3)))
#define TSB_UART_ECR_FE                           (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ECR,0)))
#define TSB_UART_ECR_PE                           (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ECR,1)))
#define TSB_UART_ECR_BE                           (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ECR,2)))
#define TSB_UART_ECR_OE                           (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ECR,3)))
#define TSB_UART_FR_CTS                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->FR,0)))
#define TSB_UART_FR_BUSY                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->FR,3)))
#define TSB_UART_FR_RXFE                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->FR,4)))
#define TSB_UART_FR_TXFF                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->FR,5)))
#define TSB_UART_FR_RXFF                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->FR,6)))
#define TSB_UART_FR_TXFE                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->FR,7)))
#define TSB_UART_LCR_H_BRK                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->LCR_H,0)))
#define TSB_UART_LCR_H_PEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->LCR_H,1)))
#define TSB_UART_LCR_H_EPS                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->LCR_H,2)))
#define TSB_UART_LCR_H_STP2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->LCR_H,3)))
#define TSB_UART_LCR_H_FEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->LCR_H,4)))
#define TSB_UART_LCR_H_SPS                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->LCR_H,7)))
#define TSB_UART_CR_UARTEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->CR,0)))
#define TSB_UART_CR_TXE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->CR,8)))
#define TSB_UART_CR_RXE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->CR,9)))
#define TSB_UART_CR_RTSEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->CR,14)))
#define TSB_UART_CR_CTSEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->CR,15)))
#define TSB_UART_IMSC_CTSMIM                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->IMSC,1)))
#define TSB_UART_IMSC_RXIM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->IMSC,4)))
#define TSB_UART_IMSC_TXIM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->IMSC,5)))
#define TSB_UART_IMSC_RTIM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->IMSC,6)))
#define TSB_UART_IMSC_FEIM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->IMSC,7)))
#define TSB_UART_IMSC_PEIM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->IMSC,8)))
#define TSB_UART_IMSC_BEIM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->IMSC,9)))
#define TSB_UART_IMSC_OEIM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->IMSC,10)))
#define TSB_UART_RIS_CTSRMIS                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->RIS,1)))
#define TSB_UART_RIS_RXRIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->RIS,4)))
#define TSB_UART_RIS_TXRIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->RIS,5)))
#define TSB_UART_RIS_RTRIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->RIS,6)))
#define TSB_UART_RIS_FERIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->RIS,7)))
#define TSB_UART_RIS_PERIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->RIS,8)))
#define TSB_UART_RIS_BERIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->RIS,9)))
#define TSB_UART_RIS_OERIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->RIS,10)))
#define TSB_UART_MIS_CTSMMIS                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->MIS,1)))
#define TSB_UART_MIS_RXMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->MIS,4)))
#define TSB_UART_MIS_TXMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->MIS,5)))
#define TSB_UART_MIS_RTMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->MIS,6)))
#define TSB_UART_MIS_FEMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->MIS,7)))
#define TSB_UART_MIS_PEMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->MIS,8)))
#define TSB_UART_MIS_BEMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->MIS,9)))
#define TSB_UART_MIS_OEMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART->MIS,10)))
#define TSB_UART_ICR_CTSMIC                       (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ICR,1)))
#define TSB_UART_ICR_RXIC                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ICR,4)))
#define TSB_UART_ICR_TXIC                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ICR,5)))
#define TSB_UART_ICR_RTIC                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ICR,6)))
#define TSB_UART_ICR_FEIC                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ICR,7)))
#define TSB_UART_ICR_PEIC                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ICR,8)))
#define TSB_UART_ICR_BEIC                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ICR,9)))
#define TSB_UART_ICR_OEIC                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART->ICR,10)))
#define TSB_UART_DMACR_RXDMAE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->DMACR,0)))
#define TSB_UART_DMACR_TXDMAE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->DMACR,1)))
#define TSB_UART_DMACR_DMAONERR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART->DMACR,2)))


