MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM343FEXBG/mcu.h
/* 12bit A/D Converter */
#define TSB_ADA_MOD0_ADS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_ADA->MOD0,0)))
#define TSB_ADA_MOD0_HPADS                        (*((__O  uint32_t *)BITBAND_PERI(&TSB_ADA->MOD0,1)))
#define TSB_ADA_MOD1_ADHWE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD1,0)))
#define TSB_ADA_MOD1_HPADHWE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD1,2)))
#define TSB_ADA_MOD1_RCUT                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD1,5)))
#define TSB_ADA_MOD1_I2AD                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD1,6)))
#define TSB_ADA_MOD1_DACON                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD1,7)))
#define TSB_ADA_MOD3_SCAN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD3,0)))
#define TSB_ADA_MOD3_REPEAT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD3,1)))
#define TSB_ADA_MOD3_AUTO                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD3,2)))
#define TSB_ADA_MOD5_ADBF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->MOD5,0)))
#define TSB_ADA_MOD5_EOCF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->MOD5,1)))
#define TSB_ADA_MOD5_HPADBF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->MOD5,2)))
#define TSB_ADA_MOD5_HPEOCF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->MOD5,3)))
#define TSB_ADA_CMPCR0_ADBIG0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->CMPCR0,4)))
#define TSB_ADA_CMPCR0_CMPCOND0                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->CMPCR0,5)))
#define TSB_ADA_CMPCR0_CMP0EN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->CMPCR0,7)))
#define TSB_ADA_CMPCR1_ADBIG1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->CMPCR1,4)))
#define TSB_ADA_CMPCR1_CMPCOND1                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->CMPCR1,5)))
#define TSB_ADA_CMPCR1_CMP1EN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->CMPCR1,7)))
#define TSB_ADA_REG00_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG00,12)))
#define TSB_ADA_REG00_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG00,13)))
#define TSB_ADA_REG00_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG00,14)))
#define TSB_ADA_REG00_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG00,16)))
#define TSB_ADA_REG00_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG00,17)))
#define TSB_ADA_REG00_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG00,18)))
#define TSB_ADA_REG01_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG01,12)))
#define TSB_ADA_REG01_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG01,13)))
#define TSB_ADA_REG01_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG01,14)))
#define TSB_ADA_REG01_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG01,16)))
#define TSB_ADA_REG01_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG01,17)))
#define TSB_ADA_REG01_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG01,18)))
#define TSB_ADA_REG02_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG02,12)))
#define TSB_ADA_REG02_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG02,13)))
#define TSB_ADA_REG02_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG02,14)))
#define TSB_ADA_REG02_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG02,16)))
#define TSB_ADA_REG02_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG02,17)))
#define TSB_ADA_REG02_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG02,18)))
#define TSB_ADA_REG03_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG03,12)))
#define TSB_ADA_REG03_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG03,13)))
#define TSB_ADA_REG03_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG03,14)))
#define TSB_ADA_REG03_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG03,16)))
#define TSB_ADA_REG03_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG03,17)))
#define TSB_ADA_REG03_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG03,18)))
#define TSB_ADA_REG04_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG04,12)))
#define TSB_ADA_REG04_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG04,13)))
#define TSB_ADA_REG04_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG04,14)))
#define TSB_ADA_REG04_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG04,16)))
#define TSB_ADA_REG04_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG04,17)))
#define TSB_ADA_REG04_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG04,18)))
#define TSB_ADA_REG05_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG05,12)))
#define TSB_ADA_REG05_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG05,13)))
#define TSB_ADA_REG05_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG05,14)))
#define TSB_ADA_REG05_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG05,16)))
#define TSB_ADA_REG05_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG05,17)))
#define TSB_ADA_REG05_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG05,18)))
#define TSB_ADA_REG06_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG06,12)))
#define TSB_ADA_REG06_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG06,13)))
#define TSB_ADA_REG06_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG06,14)))
#define TSB_ADA_REG06_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG06,16)))
#define TSB_ADA_REG06_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG06,17)))
#define TSB_ADA_REG06_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG06,18)))
#define TSB_ADA_REG07_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG07,12)))
#define TSB_ADA_REG07_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG07,13)))
#define TSB_ADA_REG07_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG07,14)))
#define TSB_ADA_REG07_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG07,16)))
#define TSB_ADA_REG07_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG07,17)))
#define TSB_ADA_REG07_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REG07,18)))
#define TSB_ADA_REGSP_ADSPRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REGSP,12)))
#define TSB_ADA_REGSP_ADOVRSPF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REGSP,13)))
#define TSB_ADA_REGSP_ADSPRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REGSP,16)))
#define TSB_ADA_REGSP_ADOVRSPF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->REGSP,17)))
#define TSB_ADA_CREG_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->CREG,12)))
#define TSB_ADA_CREG_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->CREG,13)))
#define TSB_ADA_CREG_INVALID                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->CREG,14)))
#define TSB_ADA_CREG_ADRF_MR                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->CREG,16)))
#define TSB_ADA_CREG_ADOVRF_MR                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->CREG,17)))
#define TSB_ADA_CREG_INVALID_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->CREG,18)))

#define TSB_ADB_MOD0_ADS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_ADB->MOD0,0)))
#define TSB_ADB_MOD0_HPADS                        (*((__O  uint32_t *)BITBAND_PERI(&TSB_ADB->MOD0,1)))
#define TSB_ADB_MOD1_ADHWE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD1,0)))
#define TSB_ADB_MOD1_HPADHWE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD1,2)))
#define TSB_ADB_MOD1_RCUT                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD1,5)))
#define TSB_ADB_MOD1_I2AD                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD1,6)))
#define TSB_ADB_MOD1_DACON                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD1,7)))
#define TSB_ADB_MOD3_SCAN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD3,0)))
#define TSB_ADB_MOD3_REPEAT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD3,1)))
#define TSB_ADB_MOD3_AUTO                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD3,2)))
#define TSB_ADB_MOD5_ADBF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->MOD5,0)))
#define TSB_ADB_MOD5_EOCF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->MOD5,1)))
#define TSB_ADB_MOD5_HPADBF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->MOD5,2)))
#define TSB_ADB_MOD5_HPEOCF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->MOD5,3)))
#define TSB_ADB_CMPCR0_ADBIG0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->CMPCR0,4)))
#define TSB_ADB_CMPCR0_CMPCOND0                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->CMPCR0,5)))
#define TSB_ADB_CMPCR0_CMP0EN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->CMPCR0,7)))
#define TSB_ADB_CMPCR1_ADBIG1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->CMPCR1,4)))
#define TSB_ADB_CMPCR1_CMPCOND1                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->CMPCR1,5)))
#define TSB_ADB_CMPCR1_CMP1EN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->CMPCR1,7)))
#define TSB_ADB_REG00_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG00,12)))
#define TSB_ADB_REG00_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG00,13)))
#define TSB_ADB_REG00_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG00,14)))
#define TSB_ADB_REG00_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG00,16)))
#define TSB_ADB_REG00_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG00,17)))
#define TSB_ADB_REG00_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG00,18)))
#define TSB_ADB_REG01_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG01,12)))
#define TSB_ADB_REG01_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG01,13)))
#define TSB_ADB_REG01_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG01,14)))
#define TSB_ADB_REG01_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG01,16)))
#define TSB_ADB_REG01_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG01,17)))
#define TSB_ADB_REG01_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG01,18)))
#define TSB_ADB_REG02_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG02,12)))
#define TSB_ADB_REG02_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG02,13)))
#define TSB_ADB_REG02_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG02,14)))
#define TSB_ADB_REG02_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG02,16)))
#define TSB_ADB_REG02_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG02,17)))
#define TSB_ADB_REG02_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG02,18)))
#define TSB_ADB_REG03_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG03,12)))
#define TSB_ADB_REG03_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG03,13)))
#define TSB_ADB_REG03_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG03,14)))
#define TSB_ADB_REG03_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG03,16)))
#define TSB_ADB_REG03_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG03,17)))
#define TSB_ADB_REG03_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG03,18)))
#define TSB_ADB_REG04_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG04,12)))
#define TSB_ADB_REG04_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG04,13)))
#define TSB_ADB_REG04_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG04,14)))
#define TSB_ADB_REG04_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG04,16)))
#define TSB_ADB_REG04_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG04,17)))
#define TSB_ADB_REG04_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG04,18)))
#define TSB_ADB_REG05_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG05,12)))
#define TSB_ADB_REG05_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG05,13)))
#define TSB_ADB_REG05_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG05,14)))
#define TSB_ADB_REG05_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG05,16)))
#define TSB_ADB_REG05_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG05,17)))
#define TSB_ADB_REG05_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG05,18)))
#define TSB_ADB_REG06_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG06,12)))
#define TSB_ADB_REG06_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG06,13)))
#define TSB_ADB_REG06_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG06,14)))
#define TSB_ADB_REG06_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG06,16)))
#define TSB_ADB_REG06_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG06,17)))
#define TSB_ADB_REG06_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG06,18)))
#define TSB_ADB_REG07_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG07,12)))
#define TSB_ADB_REG07_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG07,13)))
#define TSB_ADB_REG07_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG07,14)))
#define TSB_ADB_REG07_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG07,16)))
#define TSB_ADB_REG07_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG07,17)))
#define TSB_ADB_REG07_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REG07,18)))
#define TSB_ADB_REGSP_ADSPRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REGSP,12)))
#define TSB_ADB_REGSP_ADOVRSPF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REGSP,13)))
#define TSB_ADB_REGSP_ADSPRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REGSP,16)))
#define TSB_ADB_REGSP_ADOVRSPF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->REGSP,17)))
#define TSB_ADB_CREG_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->CREG,12)))
#define TSB_ADB_CREG_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->CREG,13)))
#define TSB_ADB_CREG_INVALID                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->CREG,14)))
#define TSB_ADB_CREG_ADRF_MR                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->CREG,16)))
#define TSB_ADB_CREG_ADOVRF_MR                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->CREG,17)))
#define TSB_ADB_CREG_INVALID_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->CREG,18)))

