MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM343FEXBG/mcu.h
#define TSB_ADC_MOD0_ADS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_ADC->MOD0,0)))
#define TSB_ADC_MOD0_HPADS                        (*((__O  uint32_t *)BITBAND_PERI(&TSB_ADC->MOD0,1)))
#define TSB_ADC_MOD1_ADHWE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->MOD1,0)))
#define TSB_ADC_MOD1_HPADHWE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->MOD1,2)))
#define TSB_ADC_MOD1_RCUT                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->MOD1,5)))
#define TSB_ADC_MOD1_I2AD                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->MOD1,6)))
#define TSB_ADC_MOD1_DACON                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->MOD1,7)))
#define TSB_ADC_MOD3_SCAN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->MOD3,0)))
#define TSB_ADC_MOD3_REPEAT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->MOD3,1)))
#define TSB_ADC_MOD3_AUTO                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->MOD3,2)))
#define TSB_ADC_MOD5_ADBF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->MOD5,0)))
#define TSB_ADC_MOD5_EOCF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->MOD5,1)))
#define TSB_ADC_MOD5_HPADBF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->MOD5,2)))
#define TSB_ADC_MOD5_HPEOCF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->MOD5,3)))
#define TSB_ADC_CMPCR0_ADBIG0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CMPCR0,4)))
#define TSB_ADC_CMPCR0_CMPCOND0                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CMPCR0,5)))
#define TSB_ADC_CMPCR0_CMP0EN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CMPCR0,7)))
#define TSB_ADC_CMPCR1_ADBIG1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CMPCR1,4)))
#define TSB_ADC_CMPCR1_CMPCOND1                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CMPCR1,5)))
#define TSB_ADC_CMPCR1_CMP1EN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CMPCR1,7)))
#define TSB_ADC_REG00_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG00,12)))
#define TSB_ADC_REG00_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG00,13)))
#define TSB_ADC_REG00_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG00,14)))
#define TSB_ADC_REG00_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG00,16)))
#define TSB_ADC_REG00_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG00,17)))
#define TSB_ADC_REG00_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG00,18)))
#define TSB_ADC_REG01_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG01,12)))
#define TSB_ADC_REG01_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG01,13)))
#define TSB_ADC_REG01_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG01,14)))
#define TSB_ADC_REG01_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG01,16)))
#define TSB_ADC_REG01_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG01,17)))
#define TSB_ADC_REG01_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG01,18)))
#define TSB_ADC_REG02_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG02,12)))
#define TSB_ADC_REG02_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG02,13)))
#define TSB_ADC_REG02_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG02,14)))
#define TSB_ADC_REG02_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG02,16)))
#define TSB_ADC_REG02_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG02,17)))
#define TSB_ADC_REG02_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG02,18)))
#define TSB_ADC_REG03_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG03,12)))
#define TSB_ADC_REG03_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG03,13)))
#define TSB_ADC_REG03_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG03,14)))
#define TSB_ADC_REG03_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG03,16)))
#define TSB_ADC_REG03_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG03,17)))
#define TSB_ADC_REG03_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG03,18)))
#define TSB_ADC_REG04_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG04,12)))
#define TSB_ADC_REG04_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG04,13)))
#define TSB_ADC_REG04_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG04,14)))
#define TSB_ADC_REG04_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG04,16)))
#define TSB_ADC_REG04_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG04,17)))
#define TSB_ADC_REG04_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG04,18)))
#define TSB_ADC_REG05_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG05,12)))
#define TSB_ADC_REG05_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG05,13)))
#define TSB_ADC_REG05_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG05,14)))
#define TSB_ADC_REG05_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG05,16)))
#define TSB_ADC_REG05_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG05,17)))
#define TSB_ADC_REG05_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG05,18)))
#define TSB_ADC_REG06_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG06,12)))
#define TSB_ADC_REG06_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG06,13)))
#define TSB_ADC_REG06_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG06,14)))
#define TSB_ADC_REG06_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG06,16)))
#define TSB_ADC_REG06_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG06,17)))
#define TSB_ADC_REG06_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG06,18)))
#define TSB_ADC_REG07_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG07,12)))
#define TSB_ADC_REG07_ADOVRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG07,13)))
#define TSB_ADC_REG07_INVALID                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG07,14)))
#define TSB_ADC_REG07_ADRF_MR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG07,16)))
#define TSB_ADC_REG07_ADOVRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG07,17)))
#define TSB_ADC_REG07_INVALID_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG07,18)))
#define TSB_ADC_REGSP_ADSPRF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REGSP,12)))
#define TSB_ADC_REGSP_ADOVRSPF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REGSP,13)))
#define TSB_ADC_REGSP_ADSPRF_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REGSP,16)))
#define TSB_ADC_REGSP_ADOVRSPF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REGSP,17)))
#define TSB_ADC_CREG_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->CREG,12)))
#define TSB_ADC_CREG_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->CREG,13)))
#define TSB_ADC_CREG_INVALID                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->CREG,14)))
#define TSB_ADC_CREG_ADRF_MR                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->CREG,16)))
#define TSB_ADC_CREG_ADOVRF_MR                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->CREG,17)))
#define TSB_ADC_CREG_INVALID_MR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->CREG,18)))


/* 12-bit AD converter(UnitB) Mirror */
#define TSB_ADB_PSC_REG00_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG00,12)))
#define TSB_ADB_PSC_REG00_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG00,13)))
#define TSB_ADB_PSC_REG00_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG00,14)))
#define TSB_ADB_PSC_REG00_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG00,16)))
#define TSB_ADB_PSC_REG00_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG00,17)))
#define TSB_ADB_PSC_REG00_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG00,18)))
#define TSB_ADB_PSC_REG01_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG01,12)))
#define TSB_ADB_PSC_REG01_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG01,13)))
#define TSB_ADB_PSC_REG01_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG01,14)))
#define TSB_ADB_PSC_REG01_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG01,16)))
#define TSB_ADB_PSC_REG01_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG01,17)))
#define TSB_ADB_PSC_REG01_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG01,18)))
#define TSB_ADB_PSC_REG02_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG02,12)))
#define TSB_ADB_PSC_REG02_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG02,13)))
#define TSB_ADB_PSC_REG02_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG02,14)))
#define TSB_ADB_PSC_REG02_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG02,16)))
#define TSB_ADB_PSC_REG02_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG02,17)))
#define TSB_ADB_PSC_REG02_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG02,18)))
#define TSB_ADB_PSC_REG03_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG03,12)))
#define TSB_ADB_PSC_REG03_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG03,13)))
#define TSB_ADB_PSC_REG03_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG03,14)))
#define TSB_ADB_PSC_REG03_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG03,16)))
#define TSB_ADB_PSC_REG03_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG03,17)))
#define TSB_ADB_PSC_REG03_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG03,18)))
#define TSB_ADB_PSC_REG04_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG04,12)))
#define TSB_ADB_PSC_REG04_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG04,13)))
#define TSB_ADB_PSC_REG04_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG04,14)))
#define TSB_ADB_PSC_REG04_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG04,16)))
#define TSB_ADB_PSC_REG04_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG04,17)))
#define TSB_ADB_PSC_REG04_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG04,18)))
#define TSB_ADB_PSC_REG05_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG05,12)))
#define TSB_ADB_PSC_REG05_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG05,13)))
#define TSB_ADB_PSC_REG05_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG05,14)))
#define TSB_ADB_PSC_REG05_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG05,16)))
#define TSB_ADB_PSC_REG05_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG05,17)))
#define TSB_ADB_PSC_REG05_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG05,18)))
#define TSB_ADB_PSC_REG06_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG06,12)))
#define TSB_ADB_PSC_REG06_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG06,13)))
#define TSB_ADB_PSC_REG06_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG06,14)))
#define TSB_ADB_PSC_REG06_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG06,16)))
#define TSB_ADB_PSC_REG06_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG06,17)))
#define TSB_ADB_PSC_REG06_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG06,18)))
#define TSB_ADB_PSC_REG07_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG07,12)))
#define TSB_ADB_PSC_REG07_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG07,13)))
#define TSB_ADB_PSC_REG07_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG07,14)))
#define TSB_ADB_PSC_REG07_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG07,16)))
#define TSB_ADB_PSC_REG07_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG07,17)))
#define TSB_ADB_PSC_REG07_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REG07,18)))
#define TSB_ADB_PSC_REGSP_ADSPRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REGSP,12)))
#define TSB_ADB_PSC_REGSP_ADOVRSPF                (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REGSP,13)))
#define TSB_ADB_PSC_REGSP_ADSPRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REGSP,16)))
#define TSB_ADB_PSC_REGSP_ADOVRSPF_MR             (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->REGSP,17)))
#define TSB_ADB_PSC_CREG_ADRF                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->CREG,12)))
#define TSB_ADB_PSC_CREG_ADOVRF                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->CREG,13)))
#define TSB_ADB_PSC_CREG_INVALID                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->CREG,14)))
#define TSB_ADB_PSC_CREG_ADRF_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->CREG,16)))
#define TSB_ADB_PSC_CREG_ADOVRF_MR                (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->CREG,17)))
#define TSB_ADB_PSC_CREG_INVALID_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB_PSC->CREG,18)))


/* 12-bit AD converter(UnitC) Mirror */
#define TSB_ADC_PSC_REG00_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG00,12)))
#define TSB_ADC_PSC_REG00_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG00,13)))
#define TSB_ADC_PSC_REG00_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG00,14)))
#define TSB_ADC_PSC_REG00_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG00,16)))
#define TSB_ADC_PSC_REG00_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG00,17)))
#define TSB_ADC_PSC_REG00_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG00,18)))
#define TSB_ADC_PSC_REG01_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG01,12)))
#define TSB_ADC_PSC_REG01_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG01,13)))
#define TSB_ADC_PSC_REG01_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG01,14)))
#define TSB_ADC_PSC_REG01_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG01,16)))
#define TSB_ADC_PSC_REG01_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG01,17)))
#define TSB_ADC_PSC_REG01_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG01,18)))
#define TSB_ADC_PSC_REG02_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG02,12)))
#define TSB_ADC_PSC_REG02_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG02,13)))
#define TSB_ADC_PSC_REG02_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG02,14)))
#define TSB_ADC_PSC_REG02_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG02,16)))
#define TSB_ADC_PSC_REG02_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG02,17)))
#define TSB_ADC_PSC_REG02_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG02,18)))
#define TSB_ADC_PSC_REG03_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG03,12)))
#define TSB_ADC_PSC_REG03_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG03,13)))
#define TSB_ADC_PSC_REG03_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG03,14)))
#define TSB_ADC_PSC_REG03_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG03,16)))
#define TSB_ADC_PSC_REG03_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG03,17)))
#define TSB_ADC_PSC_REG03_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG03,18)))
#define TSB_ADC_PSC_REG04_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG04,12)))
#define TSB_ADC_PSC_REG04_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG04,13)))
#define TSB_ADC_PSC_REG04_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG04,14)))
#define TSB_ADC_PSC_REG04_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG04,16)))
#define TSB_ADC_PSC_REG04_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG04,17)))
#define TSB_ADC_PSC_REG04_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG04,18)))
#define TSB_ADC_PSC_REG05_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG05,12)))
#define TSB_ADC_PSC_REG05_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG05,13)))
#define TSB_ADC_PSC_REG05_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG05,14)))
#define TSB_ADC_PSC_REG05_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG05,16)))
#define TSB_ADC_PSC_REG05_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG05,17)))
#define TSB_ADC_PSC_REG05_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG05,18)))
#define TSB_ADC_PSC_REG06_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG06,12)))
#define TSB_ADC_PSC_REG06_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG06,13)))
#define TSB_ADC_PSC_REG06_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG06,14)))
#define TSB_ADC_PSC_REG06_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG06,16)))
#define TSB_ADC_PSC_REG06_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG06,17)))
#define TSB_ADC_PSC_REG06_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG06,18)))
#define TSB_ADC_PSC_REG07_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG07,12)))
#define TSB_ADC_PSC_REG07_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG07,13)))
#define TSB_ADC_PSC_REG07_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG07,14)))
#define TSB_ADC_PSC_REG07_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG07,16)))
#define TSB_ADC_PSC_REG07_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG07,17)))
#define TSB_ADC_PSC_REG07_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REG07,18)))
#define TSB_ADC_PSC_REGSP_ADSPRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REGSP,12)))
#define TSB_ADC_PSC_REGSP_ADOVRSPF                (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REGSP,13)))
#define TSB_ADC_PSC_REGSP_ADSPRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REGSP,16)))
#define TSB_ADC_PSC_REGSP_ADOVRSPF_MR             (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->REGSP,17)))
#define TSB_ADC_PSC_CREG_ADRF                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->CREG,12)))
#define TSB_ADC_PSC_CREG_ADOVRF                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->CREG,13)))
#define TSB_ADC_PSC_CREG_INVALID                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->CREG,14)))
#define TSB_ADC_PSC_CREG_ADRF_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->CREG,16)))
#define TSB_ADC_PSC_CREG_ADOVRF_MR                (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->CREG,17)))
#define TSB_ADC_PSC_CREG_INVALID_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC_PSC->CREG,18)))


