MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM343FEXBG/mcu.h
/* 12-bit AD converter(UnitA) Mirror */
#define TSB_ADA_PSC_REG00_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG00,12)))
#define TSB_ADA_PSC_REG00_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG00,13)))
#define TSB_ADA_PSC_REG00_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG00,14)))
#define TSB_ADA_PSC_REG00_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG00,16)))
#define TSB_ADA_PSC_REG00_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG00,17)))
#define TSB_ADA_PSC_REG00_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG00,18)))
#define TSB_ADA_PSC_REG01_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG01,12)))
#define TSB_ADA_PSC_REG01_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG01,13)))
#define TSB_ADA_PSC_REG01_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG01,14)))
#define TSB_ADA_PSC_REG01_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG01,16)))
#define TSB_ADA_PSC_REG01_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG01,17)))
#define TSB_ADA_PSC_REG01_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG01,18)))
#define TSB_ADA_PSC_REG02_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG02,12)))
#define TSB_ADA_PSC_REG02_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG02,13)))
#define TSB_ADA_PSC_REG02_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG02,14)))
#define TSB_ADA_PSC_REG02_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG02,16)))
#define TSB_ADA_PSC_REG02_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG02,17)))
#define TSB_ADA_PSC_REG02_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG02,18)))
#define TSB_ADA_PSC_REG03_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG03,12)))
#define TSB_ADA_PSC_REG03_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG03,13)))
#define TSB_ADA_PSC_REG03_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG03,14)))
#define TSB_ADA_PSC_REG03_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG03,16)))
#define TSB_ADA_PSC_REG03_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG03,17)))
#define TSB_ADA_PSC_REG03_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG03,18)))
#define TSB_ADA_PSC_REG04_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG04,12)))
#define TSB_ADA_PSC_REG04_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG04,13)))
#define TSB_ADA_PSC_REG04_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG04,14)))
#define TSB_ADA_PSC_REG04_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG04,16)))
#define TSB_ADA_PSC_REG04_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG04,17)))
#define TSB_ADA_PSC_REG04_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG04,18)))
#define TSB_ADA_PSC_REG05_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG05,12)))
#define TSB_ADA_PSC_REG05_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG05,13)))
#define TSB_ADA_PSC_REG05_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG05,14)))
#define TSB_ADA_PSC_REG05_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG05,16)))
#define TSB_ADA_PSC_REG05_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG05,17)))
#define TSB_ADA_PSC_REG05_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG05,18)))
#define TSB_ADA_PSC_REG06_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG06,12)))
#define TSB_ADA_PSC_REG06_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG06,13)))
#define TSB_ADA_PSC_REG06_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG06,14)))
#define TSB_ADA_PSC_REG06_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG06,16)))
#define TSB_ADA_PSC_REG06_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG06,17)))
#define TSB_ADA_PSC_REG06_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG06,18)))
#define TSB_ADA_PSC_REG07_ADRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG07,12)))
#define TSB_ADA_PSC_REG07_ADOVRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG07,13)))
#define TSB_ADA_PSC_REG07_INVALID                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG07,14)))
#define TSB_ADA_PSC_REG07_ADRF_MR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG07,16)))
#define TSB_ADA_PSC_REG07_ADOVRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG07,17)))
#define TSB_ADA_PSC_REG07_INVALID_MR              (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REG07,18)))
#define TSB_ADA_PSC_REGSP_ADSPRF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REGSP,12)))
#define TSB_ADA_PSC_REGSP_ADOVRSPF                (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REGSP,13)))
#define TSB_ADA_PSC_REGSP_ADSPRF_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REGSP,16)))
#define TSB_ADA_PSC_REGSP_ADOVRSPF_MR             (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->REGSP,17)))
#define TSB_ADA_PSC_CREG_ADRF                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->CREG,12)))
#define TSB_ADA_PSC_CREG_ADOVRF                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->CREG,13)))
#define TSB_ADA_PSC_CREG_INVALID                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->CREG,14)))
#define TSB_ADA_PSC_CREG_ADRF_MR                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->CREG,16)))
#define TSB_ADA_PSC_CREG_ADOVRF_MR                (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->CREG,17)))
#define TSB_ADA_PSC_CREG_INVALID_MR               (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA_PSC->CREG,18)))


/* Timer D (Unit0 in BlockA) */
#define TSB_TDA0_RUN_TDRUN                        (*((__O  uint32_t *)BITBAND_PERI(&TSB_TDA0->RUN,0)))
#define TSB_TDA0_CR_TDRDE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA0->CR,2)))
#define TSB_TDA0_CR_TDMDPT00                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA0->CR,4)))
#define TSB_TDA0_CR_TDMDPT01                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA0->CR,8)))
#define TSB_TDA0_MOD_TDCLE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA0->MOD,4)))
#define TSB_TDA0_MOD_TDIV0                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA0->MOD,6)))
#define TSB_TDA0_MOD_TDIV1                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA0->MOD,7)))
#define TSB_TDA0_DMA_DMAEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA0->DMA,0)))
#define TSB_TDA0_HSWB0_OUTV0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA0->HSWB0,2)))
#define TSB_TDA0_HSWB1_OUTV1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA0->HSWB1,2)))
#define TSB_TDA0_HSW0_OUTV0                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_TDA0->HSW0,2)))
#define TSB_TDA0_HSW1_OUTV1                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_TDA0->HSW1,2)))


/* Timer D common (BlockA) */
#define TSB_TDA_BCR_TDSFT00                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA->BCR,0)))
#define TSB_TDA_BCR_TDSFT01                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA->BCR,1)))
#define TSB_TDA_BCR_TDSFT10                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA->BCR,2)))
#define TSB_TDA_BCR_TDSFT11                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA->BCR,3)))
#define TSB_TDA_BCR_PHSCHG                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA->BCR,4)))
#define TSB_TDA_EN_TDHALT                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA->EN,5)))
#define TSB_TDA_EN_TDEN0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA->EN,6)))
#define TSB_TDA_EN_TDEN1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA->EN,7)))
#define TSB_TDA_CONF_TDI2TD0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA->CONF,6)))
#define TSB_TDA_CONF_TDI2TD1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA->CONF,7)))


/* Timer D (Unit1 in BlockA) */
#define TSB_TDA1_HSWB0_OUTV0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA1->HSWB0,2)))
#define TSB_TDA1_HSWB1_OUTV1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA1->HSWB1,2)))
#define TSB_TDA1_RUN_TDRUN                        (*((__O  uint32_t *)BITBAND_PERI(&TSB_TDA1->RUN,0)))
#define TSB_TDA1_CR_TDRDE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA1->CR,2)))
#define TSB_TDA1_CR_TDMDPT10                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA1->CR,4)))
#define TSB_TDA1_CR_TDMDPT11                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA1->CR,8)))
#define TSB_TDA1_MOD_TDCLE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA1->MOD,4)))
#define TSB_TDA1_MOD_TDIV0                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA1->MOD,6)))
#define TSB_TDA1_MOD_TDIV1                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA1->MOD,7)))
#define TSB_TDA1_DMA_DMAEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDA1->DMA,0)))
#define TSB_TDA1_HSW0_OUTV0                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_TDA1->HSW0,2)))
#define TSB_TDA1_HSW1_OUTV1                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_TDA1->HSW1,2)))


/* Timer D (Unit0 in BlockB) */
#define TSB_TDB0_RUN_TDRUN                        (*((__O  uint32_t *)BITBAND_PERI(&TSB_TDB0->RUN,0)))
#define TSB_TDB0_CR_TDRDE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB0->CR,2)))
#define TSB_TDB0_CR_TDMDPT00                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB0->CR,4)))
#define TSB_TDB0_CR_TDMDPT01                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB0->CR,8)))
#define TSB_TDB0_MOD_TDCLE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB0->MOD,4)))
#define TSB_TDB0_MOD_TDIV0                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB0->MOD,6)))
#define TSB_TDB0_MOD_TDIV1                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB0->MOD,7)))
#define TSB_TDB0_DMA_DMAEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB0->DMA,0)))
#define TSB_TDB0_HSWB0_OUTV0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB0->HSWB0,2)))
#define TSB_TDB0_HSWB1_OUTV1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB0->HSWB1,2)))
#define TSB_TDB0_HSW0_OUTV0                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_TDB0->HSW0,2)))
#define TSB_TDB0_HSW1_OUTV1                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_TDB0->HSW1,2)))


/* Timer D common (BlockB) */
#define TSB_TDB_BCR_TDSFT00                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB->BCR,0)))
#define TSB_TDB_BCR_TDSFT01                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB->BCR,1)))
#define TSB_TDB_BCR_TDSFT10                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB->BCR,2)))
#define TSB_TDB_BCR_TDSFT11                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB->BCR,3)))
#define TSB_TDB_BCR_PHSCHG                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB->BCR,4)))
#define TSB_TDB_EN_TDHALT                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB->EN,5)))
#define TSB_TDB_EN_TDEN0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB->EN,6)))
#define TSB_TDB_EN_TDEN1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB->EN,7)))
#define TSB_TDB_CONF_TDI2TD0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB->CONF,6)))
#define TSB_TDB_CONF_TDI2TD1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB->CONF,7)))


/* Timer D (Unit1 in BlockB) */
#define TSB_TDB1_HSWB0_OUTV0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB1->HSWB0,2)))
#define TSB_TDB1_HSWB1_OUTV1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB1->HSWB1,2)))
#define TSB_TDB1_RUN_TDRUN                        (*((__O  uint32_t *)BITBAND_PERI(&TSB_TDB1->RUN,0)))
#define TSB_TDB1_CR_TDRDE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB1->CR,2)))
#define TSB_TDB1_CR_TDMDPT10                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB1->CR,4)))
#define TSB_TDB1_CR_TDMDPT11                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB1->CR,8)))
#define TSB_TDB1_MOD_TDCLE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB1->MOD,4)))
#define TSB_TDB1_MOD_TDIV0                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB1->MOD,6)))
#define TSB_TDB1_MOD_TDIV1                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB1->MOD,7)))
#define TSB_TDB1_DMA_DMAEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_TDB1->DMA,0)))
#define TSB_TDB1_HSW0_OUTV0                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_TDB1->HSW0,2)))
#define TSB_TDB1_HSW1_OUTV1                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_TDB1->HSW1,2)))


/* Enhannced two aspect pulse input counter (EPHC) */
#define TSB_EPHC0_EN_EN                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->EN,0)))
#define TSB_EPHC0_CNT_PBMOD                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->CNT,10)))
#define TSB_EPHC0_CNT_PBDIR                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->CNT,11)))
#define TSB_EPHC0_CNT_MA12                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->CNT,12)))
#define TSB_EPHC0_CNT_MA2DIR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->CNT,13)))
#define TSB_EPHC0_CNT_LWLMEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->CNT,18)))
#define TSB_EPHC0_CNT_UPLMEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->CNT,19)))
#define TSB_EPHC0_CNT_LOADLMT                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_EPHC0->CNT,20)))
#define TSB_EPHC0_IE_INTPCCP0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,0)))
#define TSB_EPHC0_IE_INTPCCP1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,1)))
#define TSB_EPHC0_IE_INTPCOVF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,2)))
#define TSB_EPHC0_IE_INTPCUDF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,3)))
#define TSB_EPHC0_IE_INTPCDT0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,4)))
#define TSB_EPHC0_IE_INTPCDT1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,5)))
#define TSB_EPHC0_IE_INTPCDT2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,6)))
#define TSB_EPHC0_IE_INTPCDT3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,7)))
#define TSB_EPHC0_IE_INTPCDIR                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,8)))
#define TSB_EPHC0_IE_INTPCUOVF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,9)))
#define TSB_EPHC0_IE_INTLWLMT                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,10)))
#define TSB_EPHC0_IE_INTUPLMT                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,11)))
#define TSB_EPHC0_FLG_CMP0F                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->FLG,0)))
#define TSB_EPHC0_FLG_CMP1F                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->FLG,1)))
#define TSB_EPHC0_FLG_OVFF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->FLG,2)))
#define TSB_EPHC0_FLG_UDFF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->FLG,3)))
#define TSB_EPHC0_FLG_SB0F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->FLG,4)))
#define TSB_EPHC0_FLG_SB1F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->FLG,5)))
#define TSB_EPHC0_FLG_SB2F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->FLG,6)))
#define TSB_EPHC0_FLG_SB3F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->FLG,7)))
#define TSB_EPHC0_FLG_DIRF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->FLG,8)))
#define TSB_EPHC0_FLG_LWLMT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->FLG,9)))
#define TSB_EPHC0_FLG_UPLMT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->FLG,10)))
#define TSB_EPHC0_ARUN_RUN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->ARUN,0)))
#define TSB_EPHC0_ARUN_CLR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->ARUN,1)))
#define TSB_EPHC0_ADAT_PMF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC0->ADAT,30)))
#define TSB_EPHC0_ADAT_PHCDIRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC0->ADAT,31)))
#define TSB_EPHC0_BRUN_T24RUN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->BRUN,0)))
#define TSB_EPHC0_BDMA_DMADT0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->BDMA,0)))
#define TSB_EPHC0_BDMA_DMADT1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->BDMA,1)))
#define TSB_EPHC0_BCAP00_OVF00                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC0->BCAP00,24)))
#define TSB_EPHC0_BCAP10_OVF10                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC0->BCAP10,24)))
#define TSB_EPHC0_BCAP20_OVF20                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC0->BCAP20,24)))
#define TSB_EPHC0_BCAP30_OVF30                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC0->BCAP30,24)))

#define TSB_EPHC1_EN_EN                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->EN,0)))
#define TSB_EPHC1_CNT_PBMOD                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->CNT,10)))
#define TSB_EPHC1_CNT_PBDIR                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->CNT,11)))
#define TSB_EPHC1_CNT_MA12                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->CNT,12)))
#define TSB_EPHC1_CNT_MA2DIR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->CNT,13)))
#define TSB_EPHC1_CNT_LWLMEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->CNT,18)))
#define TSB_EPHC1_CNT_UPLMEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->CNT,19)))
#define TSB_EPHC1_CNT_LOADLMT                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_EPHC1->CNT,20)))
#define TSB_EPHC1_IE_INTPCCP0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,0)))
#define TSB_EPHC1_IE_INTPCCP1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,1)))
#define TSB_EPHC1_IE_INTPCOVF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,2)))
#define TSB_EPHC1_IE_INTPCUDF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,3)))
#define TSB_EPHC1_IE_INTPCDT0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,4)))
#define TSB_EPHC1_IE_INTPCDT1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,5)))
#define TSB_EPHC1_IE_INTPCDT2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,6)))
#define TSB_EPHC1_IE_INTPCDT3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,7)))
#define TSB_EPHC1_IE_INTPCDIR                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,8)))
#define TSB_EPHC1_IE_INTPCUOVF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,9)))
#define TSB_EPHC1_IE_INTLWLMT                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,10)))
#define TSB_EPHC1_IE_INTUPLMT                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,11)))
#define TSB_EPHC1_FLG_CMP0F                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->FLG,0)))
#define TSB_EPHC1_FLG_CMP1F                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->FLG,1)))
#define TSB_EPHC1_FLG_OVFF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->FLG,2)))
#define TSB_EPHC1_FLG_UDFF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->FLG,3)))
#define TSB_EPHC1_FLG_SB0F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->FLG,4)))
#define TSB_EPHC1_FLG_SB1F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->FLG,5)))
#define TSB_EPHC1_FLG_SB2F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->FLG,6)))
#define TSB_EPHC1_FLG_SB3F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->FLG,7)))
#define TSB_EPHC1_FLG_DIRF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->FLG,8)))
#define TSB_EPHC1_FLG_LWLMT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->FLG,9)))
#define TSB_EPHC1_FLG_UPLMT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->FLG,10)))
#define TSB_EPHC1_ARUN_RUN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->ARUN,0)))
#define TSB_EPHC1_ARUN_CLR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->ARUN,1)))
#define TSB_EPHC1_ADAT_PMF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC1->ADAT,30)))
#define TSB_EPHC1_ADAT_PHCDIRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC1->ADAT,31)))
#define TSB_EPHC1_BRUN_T24RUN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->BRUN,0)))
#define TSB_EPHC1_BDMA_DMADT0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->BDMA,0)))
#define TSB_EPHC1_BDMA_DMADT1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->BDMA,1)))
#define TSB_EPHC1_BCAP00_OVF00                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC1->BCAP00,24)))
#define TSB_EPHC1_BCAP10_OVF10                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC1->BCAP10,24)))
#define TSB_EPHC1_BCAP20_OVF20                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC1->BCAP20,24)))
#define TSB_EPHC1_BCAP30_OVF30                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC1->BCAP30,24)))

