MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM343FEXBG/mcu.h
#define TSB_EPHC2_EN_EN                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->EN,0)))
#define TSB_EPHC2_CNT_PBMOD                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->CNT,10)))
#define TSB_EPHC2_CNT_PBDIR                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->CNT,11)))
#define TSB_EPHC2_CNT_MA12                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->CNT,12)))
#define TSB_EPHC2_CNT_MA2DIR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->CNT,13)))
#define TSB_EPHC2_CNT_LWLMEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->CNT,18)))
#define TSB_EPHC2_CNT_UPLMEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->CNT,19)))
#define TSB_EPHC2_CNT_LOADLMT                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_EPHC2->CNT,20)))
#define TSB_EPHC2_IE_INTPCCP0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,0)))
#define TSB_EPHC2_IE_INTPCCP1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,1)))
#define TSB_EPHC2_IE_INTPCOVF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,2)))
#define TSB_EPHC2_IE_INTPCUDF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,3)))
#define TSB_EPHC2_IE_INTPCDT0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,4)))
#define TSB_EPHC2_IE_INTPCDT1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,5)))
#define TSB_EPHC2_IE_INTPCDT2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,6)))
#define TSB_EPHC2_IE_INTPCDT3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,7)))
#define TSB_EPHC2_IE_INTPCDIR                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,8)))
#define TSB_EPHC2_IE_INTPCUOVF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,9)))
#define TSB_EPHC2_IE_INTLWLMT                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,10)))
#define TSB_EPHC2_IE_INTUPLMT                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,11)))
#define TSB_EPHC2_FLG_CMP0F                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->FLG,0)))
#define TSB_EPHC2_FLG_CMP1F                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->FLG,1)))
#define TSB_EPHC2_FLG_OVFF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->FLG,2)))
#define TSB_EPHC2_FLG_UDFF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->FLG,3)))
#define TSB_EPHC2_FLG_SB0F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->FLG,4)))
#define TSB_EPHC2_FLG_SB1F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->FLG,5)))
#define TSB_EPHC2_FLG_SB2F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->FLG,6)))
#define TSB_EPHC2_FLG_SB3F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->FLG,7)))
#define TSB_EPHC2_FLG_DIRF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->FLG,8)))
#define TSB_EPHC2_FLG_LWLMT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->FLG,9)))
#define TSB_EPHC2_FLG_UPLMT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->FLG,10)))
#define TSB_EPHC2_ARUN_RUN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->ARUN,0)))
#define TSB_EPHC2_ARUN_CLR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->ARUN,1)))
#define TSB_EPHC2_ADAT_PMF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC2->ADAT,30)))
#define TSB_EPHC2_ADAT_PHCDIRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC2->ADAT,31)))
#define TSB_EPHC2_BRUN_T24RUN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->BRUN,0)))
#define TSB_EPHC2_BDMA_DMADT0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->BDMA,0)))
#define TSB_EPHC2_BDMA_DMADT1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->BDMA,1)))
#define TSB_EPHC2_BCAP00_OVF00                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC2->BCAP00,24)))
#define TSB_EPHC2_BCAP10_OVF10                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC2->BCAP10,24)))
#define TSB_EPHC2_BCAP20_OVF20                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC2->BCAP20,24)))
#define TSB_EPHC2_BCAP30_OVF30                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC2->BCAP30,24)))


/* Enhannced two aspect pulse input counter (EPHC) Mirror */
#define TSB_EPHC0_PSC_ADAT_PMF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC0_PSC->ADAT,30)))
#define TSB_EPHC0_PSC_ADAT_PHCDIRF                (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC0_PSC->ADAT,31)))
#define TSB_EPHC0_PSC_BCAP00_OVF00                (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC0_PSC->BCAP00,24)))
#define TSB_EPHC0_PSC_BCAP10_OVF10                (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC0_PSC->BCAP10,24)))
#define TSB_EPHC0_PSC_BCAP20_OVF20                (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC0_PSC->BCAP20,24)))
#define TSB_EPHC0_PSC_BCAP30_OVF30                (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC0_PSC->BCAP30,24)))


/* Enhannced two aspect pulse input counter (EPHC) Mirror */
#define TSB_EPHC2_PSC_ADAT_PMF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC2_PSC->ADAT,30)))
#define TSB_EPHC2_PSC_ADAT_PHCDIRF                (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC2_PSC->ADAT,31)))
#define TSB_EPHC2_PSC_BCAP00_OVF00                (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC2_PSC->BCAP00,24)))
#define TSB_EPHC2_PSC_BCAP10_OVF10                (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC2_PSC->BCAP10,24)))
#define TSB_EPHC2_PSC_BCAP20_OVF20                (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC2_PSC->BCAP20,24)))
#define TSB_EPHC2_PSC_BCAP30_OVF30                (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC2_PSC->BCAP30,24)))


/* Enhannced two aspect pulse input counter (EPHC) Mirror */
#define TSB_EPHC1_PSC_ADAT_PMF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC1_PSC->ADAT,30)))
#define TSB_EPHC1_PSC_ADAT_PHCDIRF                (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC1_PSC->ADAT,31)))
#define TSB_EPHC1_PSC_BCAP00_OVF00                (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC1_PSC->BCAP00,24)))
#define TSB_EPHC1_PSC_BCAP10_OVF10                (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC1_PSC->BCAP10,24)))
#define TSB_EPHC1_PSC_BCAP20_OVF20                (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC1_PSC->BCAP20,24)))
#define TSB_EPHC1_PSC_BCAP30_OVF30                (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC1_PSC->BCAP30,24)))


