MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM343FEXBG/mcu.h
/* Flash Control (FC) */
#define TSB_FC_SECBIT_SECBIT                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_FC->SECBIT,0)))
#define TSB_FC_PSR0_RDY_BSY                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,0)))
#define TSB_FC_PSR0_PG0                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,8)))
#define TSB_FC_PSR0_PG1                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,9)))
#define TSB_FC_PSR0_PG2                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,10)))
#define TSB_FC_PSR0_PG3                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,11)))
#define TSB_FC_PSR0_PG4                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,12)))
#define TSB_FC_PSR0_PG5                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,13)))
#define TSB_FC_PSR0_PG6                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,14)))
#define TSB_FC_PSR0_PG7                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,15)))
#define TSB_FC_PSR0_BLK1                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,17)))
#define TSB_FC_PSR0_BLK2                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,18)))
#define TSB_FC_PSR0_BLK3                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,19)))
#define TSB_FC_PSR0_BLK4                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,20)))
#define TSB_FC_PSR0_BLK5                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,21)))
#define TSB_FC_PSR0_BLK6                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,22)))
#define TSB_FC_PSR0_BLK7                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,23)))
#define TSB_FC_PSR0_BLK8                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,24)))
#define TSB_FC_PSR0_BLK9                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,25)))
#define TSB_FC_PSR0_BLK10                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,26)))
#define TSB_FC_PSR0_BLK11                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,27)))
#define TSB_FC_PSR0_BLK12                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,28)))
#define TSB_FC_PSR0_BLK13                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,29)))
#define TSB_FC_PSR0_BLK14                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,30)))
#define TSB_FC_PSR0_BLK15                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR0,31)))
#define TSB_FC_PSR1_BLK16                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR1,16)))
#define TSB_FC_PSR1_BLK17                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR1,17)))
#define TSB_FC_PSR1_BLK18                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR1,18)))
#define TSB_FC_PSR1_BLK19                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR1,19)))
#define TSB_FC_PSR1_BLK20                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR1,20)))
#define TSB_FC_PSR1_BLK21                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR1,21)))
#define TSB_FC_PSR1_BLK22                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR1,22)))
#define TSB_FC_PSR1_BLK23                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR1,23)))
#define TSB_FC_PSR1_BLK24                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR1,24)))
#define TSB_FC_PSR1_BLK25                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR1,25)))
#define TSB_FC_PSR1_BLK26                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR1,26)))
#define TSB_FC_PSR1_BLK27                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR1,27)))
#define TSB_FC_PSR1_BLK28                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR1,28)))
#define TSB_FC_PSR1_BLK29                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR1,29)))
#define TSB_FC_PSR1_BLK30                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR1,30)))
#define TSB_FC_PSR1_BLK31                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->PSR1,31)))
#define TSB_FC_SR_WEABORT                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->SR,24)))

/** @} */ /* End of group Device_Peripheral_registers */

#ifdef __cplusplus
}
#endif

#endif  /* __TMPM343_H__ */

/** @} */ /* End of group TMPM343 */
/** @} */ /* End of group TOSHIBA_TX03_MICROCONTROLLER */
